MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
/*
 * Component description for AFEC
 *
 * Copyright (c) 2025 Microchip Technology Inc. and its subsidiaries.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/*  file generated from device description file (ATDF) version 2025-04-15T17:35:10Z  */
#ifndef _PIC32CZMC70_AFEC_COMPONENT_H_
#define _PIC32CZMC70_AFEC_COMPONENT_H_

/* ************************************************************************** */
/*                      SOFTWARE API DEFINITION FOR AFEC                      */
/* ************************************************************************** */

/* -------- AFEC_CR : (AFEC Offset: 0x00) ( /W 32) AFEC Control Register -------- */
#define AFEC_CR_SWRST_Pos                     _UINT32_(0)                                          /* (AFEC_CR) Software Reset Position */
#define AFEC_CR_SWRST_Msk                     (_UINT32_(0x1) << AFEC_CR_SWRST_Pos)                 /* (AFEC_CR) Software Reset Mask */
#define AFEC_CR_SWRST(value)                  (AFEC_CR_SWRST_Msk & (_UINT32_(value) << AFEC_CR_SWRST_Pos)) /* Assignment of value for SWRST in the AFEC_CR register */
#define AFEC_CR_START_Pos                     _UINT32_(1)                                          /* (AFEC_CR) Start Conversion Position */
#define AFEC_CR_START_Msk                     (_UINT32_(0x1) << AFEC_CR_START_Pos)                 /* (AFEC_CR) Start Conversion Mask */
#define AFEC_CR_START(value)                  (AFEC_CR_START_Msk & (_UINT32_(value) << AFEC_CR_START_Pos)) /* Assignment of value for START in the AFEC_CR register */
#define AFEC_CR_Msk                           _UINT32_(0x00000003)                                 /* (AFEC_CR) Register Mask  */


/* -------- AFEC_MR : (AFEC Offset: 0x04) (R/W 32) AFEC Mode Register -------- */
#define AFEC_MR_TRGEN_Pos                     _UINT32_(0)                                          /* (AFEC_MR) Trigger Enable Position */
#define AFEC_MR_TRGEN_Msk                     (_UINT32_(0x1) << AFEC_MR_TRGEN_Pos)                 /* (AFEC_MR) Trigger Enable Mask */
#define AFEC_MR_TRGEN(value)                  (AFEC_MR_TRGEN_Msk & (_UINT32_(value) << AFEC_MR_TRGEN_Pos)) /* Assignment of value for TRGEN in the AFEC_MR register */
#define   AFEC_MR_TRGEN_DIS_Val               _UINT32_(0x0)                                        /* (AFEC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software.  */
#define   AFEC_MR_TRGEN_EN_Val                _UINT32_(0x1)                                        /* (AFEC_MR) Hardware trigger selected by TRGSEL field is enabled.  */
#define AFEC_MR_TRGEN_DIS                     (AFEC_MR_TRGEN_DIS_Val << AFEC_MR_TRGEN_Pos)         /* (AFEC_MR) Hardware triggers are disabled. Starting a conversion is only possible by software. Position */
#define AFEC_MR_TRGEN_EN                      (AFEC_MR_TRGEN_EN_Val << AFEC_MR_TRGEN_Pos)          /* (AFEC_MR) Hardware trigger selected by TRGSEL field is enabled. Position */
#define AFEC_MR_TRGSEL_Pos                    _UINT32_(1)                                          /* (AFEC_MR) Trigger Selection Position */
#define AFEC_MR_TRGSEL_Msk                    (_UINT32_(0x7) << AFEC_MR_TRGSEL_Pos)                /* (AFEC_MR) Trigger Selection Mask */
#define AFEC_MR_TRGSEL(value)                 (AFEC_MR_TRGSEL_Msk & (_UINT32_(value) << AFEC_MR_TRGSEL_Pos)) /* Assignment of value for TRGSEL in the AFEC_MR register */
#define   AFEC_MR_TRGSEL_AFEC_TRIG0_Val       _UINT32_(0x0)                                        /* (AFEC_MR) AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG1_Val       _UINT32_(0x1)                                        /* (AFEC_MR) TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG2_Val       _UINT32_(0x2)                                        /* (AFEC_MR) TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG3_Val       _UINT32_(0x3)                                        /* (AFEC_MR) TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG4_Val       _UINT32_(0x4)                                        /* (AFEC_MR) PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG5_Val       _UINT32_(0x5)                                        /* (AFEC_MR) PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1  */
#define   AFEC_MR_TRGSEL_AFEC_TRIG6_Val       _UINT32_(0x6)                                        /* (AFEC_MR) Analog Comparator  */
#define AFEC_MR_TRGSEL_AFEC_TRIG0             (AFEC_MR_TRGSEL_AFEC_TRIG0_Val << AFEC_MR_TRGSEL_Pos) /* (AFEC_MR) AFE0_ADTRG for AFEC0 / AFE1_ADTRG for AFEC1 Position */
#define AFEC_MR_TRGSEL_AFEC_TRIG1             (AFEC_MR_TRGSEL_AFEC_TRIG1_Val << AFEC_MR_TRGSEL_Pos) /* (AFEC_MR) TIOA Output of the Timer Counter Channel 0 for AFEC0/TIOA Output of the Timer Counter Channel 3 for AFEC1 Position */
#define AFEC_MR_TRGSEL_AFEC_TRIG2             (AFEC_MR_TRGSEL_AFEC_TRIG2_Val << AFEC_MR_TRGSEL_Pos) /* (AFEC_MR) TIOA Output of the Timer Counter Channel 1 for AFEC0/TIOA Output of the Timer Counter Channel 4 for AFEC1 Position */
#define AFEC_MR_TRGSEL_AFEC_TRIG3             (AFEC_MR_TRGSEL_AFEC_TRIG3_Val << AFEC_MR_TRGSEL_Pos) /* (AFEC_MR) TIOA Output of the Timer Counter Channel 2 for AFEC0/TIOA Output of the Timer Counter Channel 5 for AFEC1 Position */
#define AFEC_MR_TRGSEL_AFEC_TRIG4             (AFEC_MR_TRGSEL_AFEC_TRIG4_Val << AFEC_MR_TRGSEL_Pos) /* (AFEC_MR) PWM0 event line 0 for AFEC0 / PWM1 event line 0 for AFEC1 Position */
#define AFEC_MR_TRGSEL_AFEC_TRIG5             (AFEC_MR_TRGSEL_AFEC_TRIG5_Val << AFEC_MR_TRGSEL_Pos) /* (AFEC_MR) PWM0 event line 1 for AFEC0 / PWM1 event line 1 for AFEC1 Position */
#define AFEC_MR_TRGSEL_AFEC_TRIG6             (AFEC_MR_TRGSEL_AFEC_TRIG6_Val << AFEC_MR_TRGSEL_Pos) /* (AFEC_MR) Analog Comparator Position */
#define AFEC_MR_SLEEP_Pos                     _UINT32_(5)                                          /* (AFEC_MR) Sleep Mode Position */
#define AFEC_MR_SLEEP_Msk                     (_UINT32_(0x1) << AFEC_MR_SLEEP_Pos)                 /* (AFEC_MR) Sleep Mode Mask */
#define AFEC_MR_SLEEP(value)                  (AFEC_MR_SLEEP_Msk & (_UINT32_(value) << AFEC_MR_SLEEP_Pos)) /* Assignment of value for SLEEP in the AFEC_MR register */
#define   AFEC_MR_SLEEP_NORMAL_Val            _UINT32_(0x0)                                        /* (AFEC_MR) Normal mode: The AFE and reference voltage circuitry are kept ON between conversions.  */
#define   AFEC_MR_SLEEP_SLEEP_Val             _UINT32_(0x1)                                        /* (AFEC_MR) Sleep mode: The AFE and reference voltage circuitry are OFF between conversions.  */
#define AFEC_MR_SLEEP_NORMAL                  (AFEC_MR_SLEEP_NORMAL_Val << AFEC_MR_SLEEP_Pos)      /* (AFEC_MR) Normal mode: The AFE and reference voltage circuitry are kept ON between conversions. Position */
#define AFEC_MR_SLEEP_SLEEP                   (AFEC_MR_SLEEP_SLEEP_Val << AFEC_MR_SLEEP_Pos)       /* (AFEC_MR) Sleep mode: The AFE and reference voltage circuitry are OFF between conversions. Position */
#define AFEC_MR_FWUP_Pos                      _UINT32_(6)                                          /* (AFEC_MR) Fast Wake-up Position */
#define AFEC_MR_FWUP_Msk                      (_UINT32_(0x1) << AFEC_MR_FWUP_Pos)                  /* (AFEC_MR) Fast Wake-up Mask */
#define AFEC_MR_FWUP(value)                   (AFEC_MR_FWUP_Msk & (_UINT32_(value) << AFEC_MR_FWUP_Pos)) /* Assignment of value for FWUP in the AFEC_MR register */
#define   AFEC_MR_FWUP_OFF_Val                _UINT32_(0x0)                                        /* (AFEC_MR) Normal Sleep mode: The sleep mode is defined by the SLEEP bit.  */
#define   AFEC_MR_FWUP_ON_Val                 _UINT32_(0x1)                                        /* (AFEC_MR) Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF.  */
#define AFEC_MR_FWUP_OFF                      (AFEC_MR_FWUP_OFF_Val << AFEC_MR_FWUP_Pos)           /* (AFEC_MR) Normal Sleep mode: The sleep mode is defined by the SLEEP bit. Position */
#define AFEC_MR_FWUP_ON                       (AFEC_MR_FWUP_ON_Val << AFEC_MR_FWUP_Pos)            /* (AFEC_MR) Fast wake-up Sleep mode: The voltage reference is ON between conversions and AFE is OFF. Position */
#define AFEC_MR_FREERUN_Pos                   _UINT32_(7)                                          /* (AFEC_MR) Free Run Mode Position */
#define AFEC_MR_FREERUN_Msk                   (_UINT32_(0x1) << AFEC_MR_FREERUN_Pos)               /* (AFEC_MR) Free Run Mode Mask */
#define AFEC_MR_FREERUN(value)                (AFEC_MR_FREERUN_Msk & (_UINT32_(value) << AFEC_MR_FREERUN_Pos)) /* Assignment of value for FREERUN in the AFEC_MR register */
#define   AFEC_MR_FREERUN_OFF_Val             _UINT32_(0x0)                                        /* (AFEC_MR) Normal mode  */
#define   AFEC_MR_FREERUN_ON_Val              _UINT32_(0x1)                                        /* (AFEC_MR) Free Run mode: Never wait for any trigger.  */
#define AFEC_MR_FREERUN_OFF                   (AFEC_MR_FREERUN_OFF_Val << AFEC_MR_FREERUN_Pos)     /* (AFEC_MR) Normal mode Position */
#define AFEC_MR_FREERUN_ON                    (AFEC_MR_FREERUN_ON_Val << AFEC_MR_FREERUN_Pos)      /* (AFEC_MR) Free Run mode: Never wait for any trigger. Position */
#define AFEC_MR_PRESCAL_Pos                   _UINT32_(8)                                          /* (AFEC_MR) Prescaler Rate Selection Position */
#define AFEC_MR_PRESCAL_Msk                   (_UINT32_(0xFF) << AFEC_MR_PRESCAL_Pos)              /* (AFEC_MR) Prescaler Rate Selection Mask */
#define AFEC_MR_PRESCAL(value)                (AFEC_MR_PRESCAL_Msk & (_UINT32_(value) << AFEC_MR_PRESCAL_Pos)) /* Assignment of value for PRESCAL in the AFEC_MR register */
#define AFEC_MR_STARTUP_Pos                   _UINT32_(16)                                         /* (AFEC_MR) Start-up Time Position */
#define AFEC_MR_STARTUP_Msk                   (_UINT32_(0xF) << AFEC_MR_STARTUP_Pos)               /* (AFEC_MR) Start-up Time Mask */
#define AFEC_MR_STARTUP(value)                (AFEC_MR_STARTUP_Msk & (_UINT32_(value) << AFEC_MR_STARTUP_Pos)) /* Assignment of value for STARTUP in the AFEC_MR register */
#define   AFEC_MR_STARTUP_SUT0_Val            _UINT32_(0x0)                                        /* (AFEC_MR) 0 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT8_Val            _UINT32_(0x1)                                        /* (AFEC_MR) 8 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT16_Val           _UINT32_(0x2)                                        /* (AFEC_MR) 16 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT24_Val           _UINT32_(0x3)                                        /* (AFEC_MR) 24 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT64_Val           _UINT32_(0x4)                                        /* (AFEC_MR) 64 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT80_Val           _UINT32_(0x5)                                        /* (AFEC_MR) 80 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT96_Val           _UINT32_(0x6)                                        /* (AFEC_MR) 96 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT112_Val          _UINT32_(0x7)                                        /* (AFEC_MR) 112 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT512_Val          _UINT32_(0x8)                                        /* (AFEC_MR) 512 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT576_Val          _UINT32_(0x9)                                        /* (AFEC_MR) 576 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT640_Val          _UINT32_(0xA)                                        /* (AFEC_MR) 640 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT704_Val          _UINT32_(0xB)                                        /* (AFEC_MR) 704 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT768_Val          _UINT32_(0xC)                                        /* (AFEC_MR) 768 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT832_Val          _UINT32_(0xD)                                        /* (AFEC_MR) 832 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT896_Val          _UINT32_(0xE)                                        /* (AFEC_MR) 896 periods of AFE clock  */
#define   AFEC_MR_STARTUP_SUT960_Val          _UINT32_(0xF)                                        /* (AFEC_MR) 960 periods of AFE clock  */
#define AFEC_MR_STARTUP_SUT0                  (AFEC_MR_STARTUP_SUT0_Val << AFEC_MR_STARTUP_Pos)    /* (AFEC_MR) 0 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT8                  (AFEC_MR_STARTUP_SUT8_Val << AFEC_MR_STARTUP_Pos)    /* (AFEC_MR) 8 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT16                 (AFEC_MR_STARTUP_SUT16_Val << AFEC_MR_STARTUP_Pos)   /* (AFEC_MR) 16 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT24                 (AFEC_MR_STARTUP_SUT24_Val << AFEC_MR_STARTUP_Pos)   /* (AFEC_MR) 24 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT64                 (AFEC_MR_STARTUP_SUT64_Val << AFEC_MR_STARTUP_Pos)   /* (AFEC_MR) 64 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT80                 (AFEC_MR_STARTUP_SUT80_Val << AFEC_MR_STARTUP_Pos)   /* (AFEC_MR) 80 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT96                 (AFEC_MR_STARTUP_SUT96_Val << AFEC_MR_STARTUP_Pos)   /* (AFEC_MR) 96 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT112                (AFEC_MR_STARTUP_SUT112_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 112 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT512                (AFEC_MR_STARTUP_SUT512_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 512 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT576                (AFEC_MR_STARTUP_SUT576_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 576 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT640                (AFEC_MR_STARTUP_SUT640_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 640 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT704                (AFEC_MR_STARTUP_SUT704_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 704 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT768                (AFEC_MR_STARTUP_SUT768_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 768 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT832                (AFEC_MR_STARTUP_SUT832_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 832 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT896                (AFEC_MR_STARTUP_SUT896_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 896 periods of AFE clock Position */
#define AFEC_MR_STARTUP_SUT960                (AFEC_MR_STARTUP_SUT960_Val << AFEC_MR_STARTUP_Pos)  /* (AFEC_MR) 960 periods of AFE clock Position */
#define AFEC_MR_ONE_Pos                       _UINT32_(23)                                         /* (AFEC_MR) One Position */
#define AFEC_MR_ONE_Msk                       (_UINT32_(0x1) << AFEC_MR_ONE_Pos)                   /* (AFEC_MR) One Mask */
#define AFEC_MR_ONE(value)                    (AFEC_MR_ONE_Msk & (_UINT32_(value) << AFEC_MR_ONE_Pos)) /* Assignment of value for ONE in the AFEC_MR register */
#define AFEC_MR_TRACKTIM_Pos                  _UINT32_(24)                                         /* (AFEC_MR) Tracking Time Position */
#define AFEC_MR_TRACKTIM_Msk                  (_UINT32_(0xF) << AFEC_MR_TRACKTIM_Pos)              /* (AFEC_MR) Tracking Time Mask */
#define AFEC_MR_TRACKTIM(value)               (AFEC_MR_TRACKTIM_Msk & (_UINT32_(value) << AFEC_MR_TRACKTIM_Pos)) /* Assignment of value for TRACKTIM in the AFEC_MR register */
#define AFEC_MR_TRANSFER_Pos                  _UINT32_(28)                                         /* (AFEC_MR) Transfer Period Position */
#define AFEC_MR_TRANSFER_Msk                  (_UINT32_(0x3) << AFEC_MR_TRANSFER_Pos)              /* (AFEC_MR) Transfer Period Mask */
#define AFEC_MR_TRANSFER(value)               (AFEC_MR_TRANSFER_Msk & (_UINT32_(value) << AFEC_MR_TRANSFER_Pos)) /* Assignment of value for TRANSFER in the AFEC_MR register */
#define AFEC_MR_USEQ_Pos                      _UINT32_(31)                                         /* (AFEC_MR) User Sequence Enable Position */
#define AFEC_MR_USEQ_Msk                      (_UINT32_(0x1) << AFEC_MR_USEQ_Pos)                  /* (AFEC_MR) User Sequence Enable Mask */
#define AFEC_MR_USEQ(value)                   (AFEC_MR_USEQ_Msk & (_UINT32_(value) << AFEC_MR_USEQ_Pos)) /* Assignment of value for USEQ in the AFEC_MR register */
#define   AFEC_MR_USEQ_NUM_ORDER_Val          _UINT32_(0x0)                                        /* (AFEC_MR) Normal mode: The controller converts channels in a simple numeric order.  */
#define   AFEC_MR_USEQ_REG_ORDER_Val          _UINT32_(0x1)                                        /* (AFEC_MR) User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R.  */
#define AFEC_MR_USEQ_NUM_ORDER                (AFEC_MR_USEQ_NUM_ORDER_Val << AFEC_MR_USEQ_Pos)     /* (AFEC_MR) Normal mode: The controller converts channels in a simple numeric order. Position */
#define AFEC_MR_USEQ_REG_ORDER                (AFEC_MR_USEQ_REG_ORDER_Val << AFEC_MR_USEQ_Pos)     /* (AFEC_MR) User Sequence mode: The sequence respects what is defined in AFEC_SEQ1R and AFEC_SEQ1R. Position */
#define AFEC_MR_Msk                           _UINT32_(0xBF8FFFEF)                                 /* (AFEC_MR) Register Mask  */


