MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
/* -------- AFEC_CHDR : (AFEC Offset: 0x18) ( /W 32) AFEC Channel Disable Register -------- */
#define AFEC_CHDR_CH0_Pos                     _UINT32_(0)                                          /* (AFEC_CHDR) Channel 0 Disable Position */
#define AFEC_CHDR_CH0_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH0_Pos)                 /* (AFEC_CHDR) Channel 0 Disable Mask */
#define AFEC_CHDR_CH0(value)                  (AFEC_CHDR_CH0_Msk & (_UINT32_(value) << AFEC_CHDR_CH0_Pos)) /* Assignment of value for CH0 in the AFEC_CHDR register */
#define AFEC_CHDR_CH1_Pos                     _UINT32_(1)                                          /* (AFEC_CHDR) Channel 1 Disable Position */
#define AFEC_CHDR_CH1_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH1_Pos)                 /* (AFEC_CHDR) Channel 1 Disable Mask */
#define AFEC_CHDR_CH1(value)                  (AFEC_CHDR_CH1_Msk & (_UINT32_(value) << AFEC_CHDR_CH1_Pos)) /* Assignment of value for CH1 in the AFEC_CHDR register */
#define AFEC_CHDR_CH2_Pos                     _UINT32_(2)                                          /* (AFEC_CHDR) Channel 2 Disable Position */
#define AFEC_CHDR_CH2_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH2_Pos)                 /* (AFEC_CHDR) Channel 2 Disable Mask */
#define AFEC_CHDR_CH2(value)                  (AFEC_CHDR_CH2_Msk & (_UINT32_(value) << AFEC_CHDR_CH2_Pos)) /* Assignment of value for CH2 in the AFEC_CHDR register */
#define AFEC_CHDR_CH3_Pos                     _UINT32_(3)                                          /* (AFEC_CHDR) Channel 3 Disable Position */
#define AFEC_CHDR_CH3_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH3_Pos)                 /* (AFEC_CHDR) Channel 3 Disable Mask */
#define AFEC_CHDR_CH3(value)                  (AFEC_CHDR_CH3_Msk & (_UINT32_(value) << AFEC_CHDR_CH3_Pos)) /* Assignment of value for CH3 in the AFEC_CHDR register */
#define AFEC_CHDR_CH4_Pos                     _UINT32_(4)                                          /* (AFEC_CHDR) Channel 4 Disable Position */
#define AFEC_CHDR_CH4_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH4_Pos)                 /* (AFEC_CHDR) Channel 4 Disable Mask */
#define AFEC_CHDR_CH4(value)                  (AFEC_CHDR_CH4_Msk & (_UINT32_(value) << AFEC_CHDR_CH4_Pos)) /* Assignment of value for CH4 in the AFEC_CHDR register */
#define AFEC_CHDR_CH5_Pos                     _UINT32_(5)                                          /* (AFEC_CHDR) Channel 5 Disable Position */
#define AFEC_CHDR_CH5_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH5_Pos)                 /* (AFEC_CHDR) Channel 5 Disable Mask */
#define AFEC_CHDR_CH5(value)                  (AFEC_CHDR_CH5_Msk & (_UINT32_(value) << AFEC_CHDR_CH5_Pos)) /* Assignment of value for CH5 in the AFEC_CHDR register */
#define AFEC_CHDR_CH6_Pos                     _UINT32_(6)                                          /* (AFEC_CHDR) Channel 6 Disable Position */
#define AFEC_CHDR_CH6_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH6_Pos)                 /* (AFEC_CHDR) Channel 6 Disable Mask */
#define AFEC_CHDR_CH6(value)                  (AFEC_CHDR_CH6_Msk & (_UINT32_(value) << AFEC_CHDR_CH6_Pos)) /* Assignment of value for CH6 in the AFEC_CHDR register */
#define AFEC_CHDR_CH7_Pos                     _UINT32_(7)                                          /* (AFEC_CHDR) Channel 7 Disable Position */
#define AFEC_CHDR_CH7_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH7_Pos)                 /* (AFEC_CHDR) Channel 7 Disable Mask */
#define AFEC_CHDR_CH7(value)                  (AFEC_CHDR_CH7_Msk & (_UINT32_(value) << AFEC_CHDR_CH7_Pos)) /* Assignment of value for CH7 in the AFEC_CHDR register */
#define AFEC_CHDR_CH8_Pos                     _UINT32_(8)                                          /* (AFEC_CHDR) Channel 8 Disable Position */
#define AFEC_CHDR_CH8_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH8_Pos)                 /* (AFEC_CHDR) Channel 8 Disable Mask */
#define AFEC_CHDR_CH8(value)                  (AFEC_CHDR_CH8_Msk & (_UINT32_(value) << AFEC_CHDR_CH8_Pos)) /* Assignment of value for CH8 in the AFEC_CHDR register */
#define AFEC_CHDR_CH9_Pos                     _UINT32_(9)                                          /* (AFEC_CHDR) Channel 9 Disable Position */
#define AFEC_CHDR_CH9_Msk                     (_UINT32_(0x1) << AFEC_CHDR_CH9_Pos)                 /* (AFEC_CHDR) Channel 9 Disable Mask */
#define AFEC_CHDR_CH9(value)                  (AFEC_CHDR_CH9_Msk & (_UINT32_(value) << AFEC_CHDR_CH9_Pos)) /* Assignment of value for CH9 in the AFEC_CHDR register */
#define AFEC_CHDR_CH10_Pos                    _UINT32_(10)                                         /* (AFEC_CHDR) Channel 10 Disable Position */
#define AFEC_CHDR_CH10_Msk                    (_UINT32_(0x1) << AFEC_CHDR_CH10_Pos)                /* (AFEC_CHDR) Channel 10 Disable Mask */
#define AFEC_CHDR_CH10(value)                 (AFEC_CHDR_CH10_Msk & (_UINT32_(value) << AFEC_CHDR_CH10_Pos)) /* Assignment of value for CH10 in the AFEC_CHDR register */
#define AFEC_CHDR_CH11_Pos                    _UINT32_(11)                                         /* (AFEC_CHDR) Channel 11 Disable Position */
#define AFEC_CHDR_CH11_Msk                    (_UINT32_(0x1) << AFEC_CHDR_CH11_Pos)                /* (AFEC_CHDR) Channel 11 Disable Mask */
#define AFEC_CHDR_CH11(value)                 (AFEC_CHDR_CH11_Msk & (_UINT32_(value) << AFEC_CHDR_CH11_Pos)) /* Assignment of value for CH11 in the AFEC_CHDR register */
#define AFEC_CHDR_Msk                         _UINT32_(0x00000FFF)                                 /* (AFEC_CHDR) Register Mask  */

#define AFEC_CHDR_CH_Pos                      _UINT32_(0)                                          /* (AFEC_CHDR Position) Channel xx Disable */
#define AFEC_CHDR_CH_Msk                      (_UINT32_(0xFFF) << AFEC_CHDR_CH_Pos)                /* (AFEC_CHDR Mask) CH */
#define AFEC_CHDR_CH(value)                   (AFEC_CHDR_CH_Msk & (_UINT32_(value) << AFEC_CHDR_CH_Pos)) 

/* -------- AFEC_CHSR : (AFEC Offset: 0x1C) ( R/ 32) AFEC Channel Status Register -------- */
#define AFEC_CHSR_CH0_Pos                     _UINT32_(0)                                          /* (AFEC_CHSR) Channel 0 Status Position */
#define AFEC_CHSR_CH0_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH0_Pos)                 /* (AFEC_CHSR) Channel 0 Status Mask */
#define AFEC_CHSR_CH0(value)                  (AFEC_CHSR_CH0_Msk & (_UINT32_(value) << AFEC_CHSR_CH0_Pos)) /* Assignment of value for CH0 in the AFEC_CHSR register */
#define AFEC_CHSR_CH1_Pos                     _UINT32_(1)                                          /* (AFEC_CHSR) Channel 1 Status Position */
#define AFEC_CHSR_CH1_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH1_Pos)                 /* (AFEC_CHSR) Channel 1 Status Mask */
#define AFEC_CHSR_CH1(value)                  (AFEC_CHSR_CH1_Msk & (_UINT32_(value) << AFEC_CHSR_CH1_Pos)) /* Assignment of value for CH1 in the AFEC_CHSR register */
#define AFEC_CHSR_CH2_Pos                     _UINT32_(2)                                          /* (AFEC_CHSR) Channel 2 Status Position */
#define AFEC_CHSR_CH2_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH2_Pos)                 /* (AFEC_CHSR) Channel 2 Status Mask */
#define AFEC_CHSR_CH2(value)                  (AFEC_CHSR_CH2_Msk & (_UINT32_(value) << AFEC_CHSR_CH2_Pos)) /* Assignment of value for CH2 in the AFEC_CHSR register */
#define AFEC_CHSR_CH3_Pos                     _UINT32_(3)                                          /* (AFEC_CHSR) Channel 3 Status Position */
#define AFEC_CHSR_CH3_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH3_Pos)                 /* (AFEC_CHSR) Channel 3 Status Mask */
#define AFEC_CHSR_CH3(value)                  (AFEC_CHSR_CH3_Msk & (_UINT32_(value) << AFEC_CHSR_CH3_Pos)) /* Assignment of value for CH3 in the AFEC_CHSR register */
#define AFEC_CHSR_CH4_Pos                     _UINT32_(4)                                          /* (AFEC_CHSR) Channel 4 Status Position */
#define AFEC_CHSR_CH4_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH4_Pos)                 /* (AFEC_CHSR) Channel 4 Status Mask */
#define AFEC_CHSR_CH4(value)                  (AFEC_CHSR_CH4_Msk & (_UINT32_(value) << AFEC_CHSR_CH4_Pos)) /* Assignment of value for CH4 in the AFEC_CHSR register */
#define AFEC_CHSR_CH5_Pos                     _UINT32_(5)                                          /* (AFEC_CHSR) Channel 5 Status Position */
#define AFEC_CHSR_CH5_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH5_Pos)                 /* (AFEC_CHSR) Channel 5 Status Mask */
#define AFEC_CHSR_CH5(value)                  (AFEC_CHSR_CH5_Msk & (_UINT32_(value) << AFEC_CHSR_CH5_Pos)) /* Assignment of value for CH5 in the AFEC_CHSR register */
#define AFEC_CHSR_CH6_Pos                     _UINT32_(6)                                          /* (AFEC_CHSR) Channel 6 Status Position */
#define AFEC_CHSR_CH6_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH6_Pos)                 /* (AFEC_CHSR) Channel 6 Status Mask */
#define AFEC_CHSR_CH6(value)                  (AFEC_CHSR_CH6_Msk & (_UINT32_(value) << AFEC_CHSR_CH6_Pos)) /* Assignment of value for CH6 in the AFEC_CHSR register */
#define AFEC_CHSR_CH7_Pos                     _UINT32_(7)                                          /* (AFEC_CHSR) Channel 7 Status Position */
#define AFEC_CHSR_CH7_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH7_Pos)                 /* (AFEC_CHSR) Channel 7 Status Mask */
#define AFEC_CHSR_CH7(value)                  (AFEC_CHSR_CH7_Msk & (_UINT32_(value) << AFEC_CHSR_CH7_Pos)) /* Assignment of value for CH7 in the AFEC_CHSR register */
#define AFEC_CHSR_CH8_Pos                     _UINT32_(8)                                          /* (AFEC_CHSR) Channel 8 Status Position */
#define AFEC_CHSR_CH8_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH8_Pos)                 /* (AFEC_CHSR) Channel 8 Status Mask */
#define AFEC_CHSR_CH8(value)                  (AFEC_CHSR_CH8_Msk & (_UINT32_(value) << AFEC_CHSR_CH8_Pos)) /* Assignment of value for CH8 in the AFEC_CHSR register */
#define AFEC_CHSR_CH9_Pos                     _UINT32_(9)                                          /* (AFEC_CHSR) Channel 9 Status Position */
#define AFEC_CHSR_CH9_Msk                     (_UINT32_(0x1) << AFEC_CHSR_CH9_Pos)                 /* (AFEC_CHSR) Channel 9 Status Mask */
#define AFEC_CHSR_CH9(value)                  (AFEC_CHSR_CH9_Msk & (_UINT32_(value) << AFEC_CHSR_CH9_Pos)) /* Assignment of value for CH9 in the AFEC_CHSR register */
#define AFEC_CHSR_CH10_Pos                    _UINT32_(10)                                         /* (AFEC_CHSR) Channel 10 Status Position */
#define AFEC_CHSR_CH10_Msk                    (_UINT32_(0x1) << AFEC_CHSR_CH10_Pos)                /* (AFEC_CHSR) Channel 10 Status Mask */
#define AFEC_CHSR_CH10(value)                 (AFEC_CHSR_CH10_Msk & (_UINT32_(value) << AFEC_CHSR_CH10_Pos)) /* Assignment of value for CH10 in the AFEC_CHSR register */
#define AFEC_CHSR_CH11_Pos                    _UINT32_(11)                                         /* (AFEC_CHSR) Channel 11 Status Position */
#define AFEC_CHSR_CH11_Msk                    (_UINT32_(0x1) << AFEC_CHSR_CH11_Pos)                /* (AFEC_CHSR) Channel 11 Status Mask */
#define AFEC_CHSR_CH11(value)                 (AFEC_CHSR_CH11_Msk & (_UINT32_(value) << AFEC_CHSR_CH11_Pos)) /* Assignment of value for CH11 in the AFEC_CHSR register */
#define AFEC_CHSR_Msk                         _UINT32_(0x00000FFF)                                 /* (AFEC_CHSR) Register Mask  */

