MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
#define AFEC_CHSR_CH_Pos                      _UINT32_(0)                                          /* (AFEC_CHSR Position) Channel xx Status */
#define AFEC_CHSR_CH_Msk                      (_UINT32_(0xFFF) << AFEC_CHSR_CH_Pos)                /* (AFEC_CHSR Mask) CH */
#define AFEC_CHSR_CH(value)                   (AFEC_CHSR_CH_Msk & (_UINT32_(value) << AFEC_CHSR_CH_Pos)) 

/* -------- AFEC_LCDR : (AFEC Offset: 0x20) ( R/ 32) AFEC Last Converted Data Register -------- */
#define AFEC_LCDR_LDATA_Pos                   _UINT32_(0)                                          /* (AFEC_LCDR) Last Data Converted Position */
#define AFEC_LCDR_LDATA_Msk                   (_UINT32_(0xFFFF) << AFEC_LCDR_LDATA_Pos)            /* (AFEC_LCDR) Last Data Converted Mask */
#define AFEC_LCDR_LDATA(value)                (AFEC_LCDR_LDATA_Msk & (_UINT32_(value) << AFEC_LCDR_LDATA_Pos)) /* Assignment of value for LDATA in the AFEC_LCDR register */
#define AFEC_LCDR_CHNB_Pos                    _UINT32_(24)                                         /* (AFEC_LCDR) Channel Number Position */
#define AFEC_LCDR_CHNB_Msk                    (_UINT32_(0xF) << AFEC_LCDR_CHNB_Pos)                /* (AFEC_LCDR) Channel Number Mask */
#define AFEC_LCDR_CHNB(value)                 (AFEC_LCDR_CHNB_Msk & (_UINT32_(value) << AFEC_LCDR_CHNB_Pos)) /* Assignment of value for CHNB in the AFEC_LCDR register */
#define AFEC_LCDR_Msk                         _UINT32_(0x0F00FFFF)                                 /* (AFEC_LCDR) Register Mask  */


/* -------- AFEC_IER : (AFEC Offset: 0x24) ( /W 32) AFEC Interrupt Enable Register -------- */
#define AFEC_IER_EOC0_Pos                     _UINT32_(0)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 0 Position */
#define AFEC_IER_EOC0_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC0_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 0 Mask */
#define AFEC_IER_EOC0(value)                  (AFEC_IER_EOC0_Msk & (_UINT32_(value) << AFEC_IER_EOC0_Pos)) /* Assignment of value for EOC0 in the AFEC_IER register */
#define AFEC_IER_EOC1_Pos                     _UINT32_(1)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 1 Position */
#define AFEC_IER_EOC1_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC1_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 1 Mask */
#define AFEC_IER_EOC1(value)                  (AFEC_IER_EOC1_Msk & (_UINT32_(value) << AFEC_IER_EOC1_Pos)) /* Assignment of value for EOC1 in the AFEC_IER register */
#define AFEC_IER_EOC2_Pos                     _UINT32_(2)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 2 Position */
#define AFEC_IER_EOC2_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC2_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 2 Mask */
#define AFEC_IER_EOC2(value)                  (AFEC_IER_EOC2_Msk & (_UINT32_(value) << AFEC_IER_EOC2_Pos)) /* Assignment of value for EOC2 in the AFEC_IER register */
#define AFEC_IER_EOC3_Pos                     _UINT32_(3)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 3 Position */
#define AFEC_IER_EOC3_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC3_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 3 Mask */
#define AFEC_IER_EOC3(value)                  (AFEC_IER_EOC3_Msk & (_UINT32_(value) << AFEC_IER_EOC3_Pos)) /* Assignment of value for EOC3 in the AFEC_IER register */
#define AFEC_IER_EOC4_Pos                     _UINT32_(4)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 4 Position */
#define AFEC_IER_EOC4_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC4_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 4 Mask */
#define AFEC_IER_EOC4(value)                  (AFEC_IER_EOC4_Msk & (_UINT32_(value) << AFEC_IER_EOC4_Pos)) /* Assignment of value for EOC4 in the AFEC_IER register */
#define AFEC_IER_EOC5_Pos                     _UINT32_(5)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 5 Position */
#define AFEC_IER_EOC5_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC5_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 5 Mask */
#define AFEC_IER_EOC5(value)                  (AFEC_IER_EOC5_Msk & (_UINT32_(value) << AFEC_IER_EOC5_Pos)) /* Assignment of value for EOC5 in the AFEC_IER register */
#define AFEC_IER_EOC6_Pos                     _UINT32_(6)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 6 Position */
#define AFEC_IER_EOC6_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC6_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 6 Mask */
#define AFEC_IER_EOC6(value)                  (AFEC_IER_EOC6_Msk & (_UINT32_(value) << AFEC_IER_EOC6_Pos)) /* Assignment of value for EOC6 in the AFEC_IER register */
#define AFEC_IER_EOC7_Pos                     _UINT32_(7)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 7 Position */
#define AFEC_IER_EOC7_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC7_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 7 Mask */
#define AFEC_IER_EOC7(value)                  (AFEC_IER_EOC7_Msk & (_UINT32_(value) << AFEC_IER_EOC7_Pos)) /* Assignment of value for EOC7 in the AFEC_IER register */
#define AFEC_IER_EOC8_Pos                     _UINT32_(8)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 8 Position */
#define AFEC_IER_EOC8_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC8_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 8 Mask */
#define AFEC_IER_EOC8(value)                  (AFEC_IER_EOC8_Msk & (_UINT32_(value) << AFEC_IER_EOC8_Pos)) /* Assignment of value for EOC8 in the AFEC_IER register */
#define AFEC_IER_EOC9_Pos                     _UINT32_(9)                                          /* (AFEC_IER) End of Conversion Interrupt Enable 9 Position */
#define AFEC_IER_EOC9_Msk                     (_UINT32_(0x1) << AFEC_IER_EOC9_Pos)                 /* (AFEC_IER) End of Conversion Interrupt Enable 9 Mask */
#define AFEC_IER_EOC9(value)                  (AFEC_IER_EOC9_Msk & (_UINT32_(value) << AFEC_IER_EOC9_Pos)) /* Assignment of value for EOC9 in the AFEC_IER register */
#define AFEC_IER_EOC10_Pos                    _UINT32_(10)                                         /* (AFEC_IER) End of Conversion Interrupt Enable 10 Position */
#define AFEC_IER_EOC10_Msk                    (_UINT32_(0x1) << AFEC_IER_EOC10_Pos)                /* (AFEC_IER) End of Conversion Interrupt Enable 10 Mask */
#define AFEC_IER_EOC10(value)                 (AFEC_IER_EOC10_Msk & (_UINT32_(value) << AFEC_IER_EOC10_Pos)) /* Assignment of value for EOC10 in the AFEC_IER register */
#define AFEC_IER_EOC11_Pos                    _UINT32_(11)                                         /* (AFEC_IER) End of Conversion Interrupt Enable 11 Position */
#define AFEC_IER_EOC11_Msk                    (_UINT32_(0x1) << AFEC_IER_EOC11_Pos)                /* (AFEC_IER) End of Conversion Interrupt Enable 11 Mask */
#define AFEC_IER_EOC11(value)                 (AFEC_IER_EOC11_Msk & (_UINT32_(value) << AFEC_IER_EOC11_Pos)) /* Assignment of value for EOC11 in the AFEC_IER register */
#define AFEC_IER_DRDY_Pos                     _UINT32_(24)                                         /* (AFEC_IER) Data Ready Interrupt Enable Position */
#define AFEC_IER_DRDY_Msk                     (_UINT32_(0x1) << AFEC_IER_DRDY_Pos)                 /* (AFEC_IER) Data Ready Interrupt Enable Mask */
#define AFEC_IER_DRDY(value)                  (AFEC_IER_DRDY_Msk & (_UINT32_(value) << AFEC_IER_DRDY_Pos)) /* Assignment of value for DRDY in the AFEC_IER register */
#define AFEC_IER_GOVRE_Pos                    _UINT32_(25)                                         /* (AFEC_IER) General Overrun Error Interrupt Enable Position */
#define AFEC_IER_GOVRE_Msk                    (_UINT32_(0x1) << AFEC_IER_GOVRE_Pos)                /* (AFEC_IER) General Overrun Error Interrupt Enable Mask */
#define AFEC_IER_GOVRE(value)                 (AFEC_IER_GOVRE_Msk & (_UINT32_(value) << AFEC_IER_GOVRE_Pos)) /* Assignment of value for GOVRE in the AFEC_IER register */
#define AFEC_IER_COMPE_Pos                    _UINT32_(26)                                         /* (AFEC_IER) Comparison Event Interrupt Enable Position */
#define AFEC_IER_COMPE_Msk                    (_UINT32_(0x1) << AFEC_IER_COMPE_Pos)                /* (AFEC_IER) Comparison Event Interrupt Enable Mask */
#define AFEC_IER_COMPE(value)                 (AFEC_IER_COMPE_Msk & (_UINT32_(value) << AFEC_IER_COMPE_Pos)) /* Assignment of value for COMPE in the AFEC_IER register */
#define AFEC_IER_TEMPCHG_Pos                  _UINT32_(30)                                         /* (AFEC_IER) Temperature Change Interrupt Enable Position */
#define AFEC_IER_TEMPCHG_Msk                  (_UINT32_(0x1) << AFEC_IER_TEMPCHG_Pos)              /* (AFEC_IER) Temperature Change Interrupt Enable Mask */
#define AFEC_IER_TEMPCHG(value)               (AFEC_IER_TEMPCHG_Msk & (_UINT32_(value) << AFEC_IER_TEMPCHG_Pos)) /* Assignment of value for TEMPCHG in the AFEC_IER register */
#define AFEC_IER_Msk                          _UINT32_(0x47000FFF)                                 /* (AFEC_IER) Register Mask  */

