MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
#define AFEC_IER_EOC_Pos                      _UINT32_(0)                                          /* (AFEC_IER Position) End of Conversion Interrupt Enable x */
#define AFEC_IER_EOC_Msk                      (_UINT32_(0xFFF) << AFEC_IER_EOC_Pos)                /* (AFEC_IER Mask) EOC */
#define AFEC_IER_EOC(value)                   (AFEC_IER_EOC_Msk & (_UINT32_(value) << AFEC_IER_EOC_Pos)) 

/* -------- AFEC_IDR : (AFEC Offset: 0x28) ( /W 32) AFEC Interrupt Disable Register -------- */
#define AFEC_IDR_EOC0_Pos                     _UINT32_(0)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 0 Position */
#define AFEC_IDR_EOC0_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC0_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 0 Mask */
#define AFEC_IDR_EOC0(value)                  (AFEC_IDR_EOC0_Msk & (_UINT32_(value) << AFEC_IDR_EOC0_Pos)) /* Assignment of value for EOC0 in the AFEC_IDR register */
#define AFEC_IDR_EOC1_Pos                     _UINT32_(1)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 1 Position */
#define AFEC_IDR_EOC1_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC1_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 1 Mask */
#define AFEC_IDR_EOC1(value)                  (AFEC_IDR_EOC1_Msk & (_UINT32_(value) << AFEC_IDR_EOC1_Pos)) /* Assignment of value for EOC1 in the AFEC_IDR register */
#define AFEC_IDR_EOC2_Pos                     _UINT32_(2)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 2 Position */
#define AFEC_IDR_EOC2_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC2_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 2 Mask */
#define AFEC_IDR_EOC2(value)                  (AFEC_IDR_EOC2_Msk & (_UINT32_(value) << AFEC_IDR_EOC2_Pos)) /* Assignment of value for EOC2 in the AFEC_IDR register */
#define AFEC_IDR_EOC3_Pos                     _UINT32_(3)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 3 Position */
#define AFEC_IDR_EOC3_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC3_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 3 Mask */
#define AFEC_IDR_EOC3(value)                  (AFEC_IDR_EOC3_Msk & (_UINT32_(value) << AFEC_IDR_EOC3_Pos)) /* Assignment of value for EOC3 in the AFEC_IDR register */
#define AFEC_IDR_EOC4_Pos                     _UINT32_(4)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 4 Position */
#define AFEC_IDR_EOC4_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC4_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 4 Mask */
#define AFEC_IDR_EOC4(value)                  (AFEC_IDR_EOC4_Msk & (_UINT32_(value) << AFEC_IDR_EOC4_Pos)) /* Assignment of value for EOC4 in the AFEC_IDR register */
#define AFEC_IDR_EOC5_Pos                     _UINT32_(5)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 5 Position */
#define AFEC_IDR_EOC5_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC5_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 5 Mask */
#define AFEC_IDR_EOC5(value)                  (AFEC_IDR_EOC5_Msk & (_UINT32_(value) << AFEC_IDR_EOC5_Pos)) /* Assignment of value for EOC5 in the AFEC_IDR register */
#define AFEC_IDR_EOC6_Pos                     _UINT32_(6)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 6 Position */
#define AFEC_IDR_EOC6_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC6_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 6 Mask */
#define AFEC_IDR_EOC6(value)                  (AFEC_IDR_EOC6_Msk & (_UINT32_(value) << AFEC_IDR_EOC6_Pos)) /* Assignment of value for EOC6 in the AFEC_IDR register */
#define AFEC_IDR_EOC7_Pos                     _UINT32_(7)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 7 Position */
#define AFEC_IDR_EOC7_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC7_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 7 Mask */
#define AFEC_IDR_EOC7(value)                  (AFEC_IDR_EOC7_Msk & (_UINT32_(value) << AFEC_IDR_EOC7_Pos)) /* Assignment of value for EOC7 in the AFEC_IDR register */
#define AFEC_IDR_EOC8_Pos                     _UINT32_(8)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 8 Position */
#define AFEC_IDR_EOC8_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC8_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 8 Mask */
#define AFEC_IDR_EOC8(value)                  (AFEC_IDR_EOC8_Msk & (_UINT32_(value) << AFEC_IDR_EOC8_Pos)) /* Assignment of value for EOC8 in the AFEC_IDR register */
#define AFEC_IDR_EOC9_Pos                     _UINT32_(9)                                          /* (AFEC_IDR) End of Conversion Interrupt Disable 9 Position */
#define AFEC_IDR_EOC9_Msk                     (_UINT32_(0x1) << AFEC_IDR_EOC9_Pos)                 /* (AFEC_IDR) End of Conversion Interrupt Disable 9 Mask */
#define AFEC_IDR_EOC9(value)                  (AFEC_IDR_EOC9_Msk & (_UINT32_(value) << AFEC_IDR_EOC9_Pos)) /* Assignment of value for EOC9 in the AFEC_IDR register */
#define AFEC_IDR_EOC10_Pos                    _UINT32_(10)                                         /* (AFEC_IDR) End of Conversion Interrupt Disable 10 Position */
#define AFEC_IDR_EOC10_Msk                    (_UINT32_(0x1) << AFEC_IDR_EOC10_Pos)                /* (AFEC_IDR) End of Conversion Interrupt Disable 10 Mask */
#define AFEC_IDR_EOC10(value)                 (AFEC_IDR_EOC10_Msk & (_UINT32_(value) << AFEC_IDR_EOC10_Pos)) /* Assignment of value for EOC10 in the AFEC_IDR register */
#define AFEC_IDR_EOC11_Pos                    _UINT32_(11)                                         /* (AFEC_IDR) End of Conversion Interrupt Disable 11 Position */
#define AFEC_IDR_EOC11_Msk                    (_UINT32_(0x1) << AFEC_IDR_EOC11_Pos)                /* (AFEC_IDR) End of Conversion Interrupt Disable 11 Mask */
#define AFEC_IDR_EOC11(value)                 (AFEC_IDR_EOC11_Msk & (_UINT32_(value) << AFEC_IDR_EOC11_Pos)) /* Assignment of value for EOC11 in the AFEC_IDR register */
#define AFEC_IDR_DRDY_Pos                     _UINT32_(24)                                         /* (AFEC_IDR) Data Ready Interrupt Disable Position */
#define AFEC_IDR_DRDY_Msk                     (_UINT32_(0x1) << AFEC_IDR_DRDY_Pos)                 /* (AFEC_IDR) Data Ready Interrupt Disable Mask */
#define AFEC_IDR_DRDY(value)                  (AFEC_IDR_DRDY_Msk & (_UINT32_(value) << AFEC_IDR_DRDY_Pos)) /* Assignment of value for DRDY in the AFEC_IDR register */
#define AFEC_IDR_GOVRE_Pos                    _UINT32_(25)                                         /* (AFEC_IDR) General Overrun Error Interrupt Disable Position */
#define AFEC_IDR_GOVRE_Msk                    (_UINT32_(0x1) << AFEC_IDR_GOVRE_Pos)                /* (AFEC_IDR) General Overrun Error Interrupt Disable Mask */
#define AFEC_IDR_GOVRE(value)                 (AFEC_IDR_GOVRE_Msk & (_UINT32_(value) << AFEC_IDR_GOVRE_Pos)) /* Assignment of value for GOVRE in the AFEC_IDR register */
#define AFEC_IDR_COMPE_Pos                    _UINT32_(26)                                         /* (AFEC_IDR) Comparison Event Interrupt Disable Position */
#define AFEC_IDR_COMPE_Msk                    (_UINT32_(0x1) << AFEC_IDR_COMPE_Pos)                /* (AFEC_IDR) Comparison Event Interrupt Disable Mask */
#define AFEC_IDR_COMPE(value)                 (AFEC_IDR_COMPE_Msk & (_UINT32_(value) << AFEC_IDR_COMPE_Pos)) /* Assignment of value for COMPE in the AFEC_IDR register */
#define AFEC_IDR_TEMPCHG_Pos                  _UINT32_(30)                                         /* (AFEC_IDR) Temperature Change Interrupt Disable Position */
#define AFEC_IDR_TEMPCHG_Msk                  (_UINT32_(0x1) << AFEC_IDR_TEMPCHG_Pos)              /* (AFEC_IDR) Temperature Change Interrupt Disable Mask */
#define AFEC_IDR_TEMPCHG(value)               (AFEC_IDR_TEMPCHG_Msk & (_UINT32_(value) << AFEC_IDR_TEMPCHG_Pos)) /* Assignment of value for TEMPCHG in the AFEC_IDR register */
#define AFEC_IDR_Msk                          _UINT32_(0x47000FFF)                                 /* (AFEC_IDR) Register Mask  */

