MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
#define AFEC_IMR_EOC_Pos                      _UINT32_(0)                                          /* (AFEC_IMR Position) End of Conversion Interrupt Mask x */
#define AFEC_IMR_EOC_Msk                      (_UINT32_(0xFFF) << AFEC_IMR_EOC_Pos)                /* (AFEC_IMR Mask) EOC */
#define AFEC_IMR_EOC(value)                   (AFEC_IMR_EOC_Msk & (_UINT32_(value) << AFEC_IMR_EOC_Pos)) 

/* -------- AFEC_ISR : (AFEC Offset: 0x30) ( R/ 32) AFEC Interrupt Status Register -------- */
#define AFEC_ISR_EOC0_Pos                     _UINT32_(0)                                          /* (AFEC_ISR) End of Conversion 0 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC0_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC0_Pos)                 /* (AFEC_ISR) End of Conversion 0 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC0(value)                  (AFEC_ISR_EOC0_Msk & (_UINT32_(value) << AFEC_ISR_EOC0_Pos)) /* Assignment of value for EOC0 in the AFEC_ISR register */
#define AFEC_ISR_EOC1_Pos                     _UINT32_(1)                                          /* (AFEC_ISR) End of Conversion 1 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC1_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC1_Pos)                 /* (AFEC_ISR) End of Conversion 1 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC1(value)                  (AFEC_ISR_EOC1_Msk & (_UINT32_(value) << AFEC_ISR_EOC1_Pos)) /* Assignment of value for EOC1 in the AFEC_ISR register */
#define AFEC_ISR_EOC2_Pos                     _UINT32_(2)                                          /* (AFEC_ISR) End of Conversion 2 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC2_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC2_Pos)                 /* (AFEC_ISR) End of Conversion 2 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC2(value)                  (AFEC_ISR_EOC2_Msk & (_UINT32_(value) << AFEC_ISR_EOC2_Pos)) /* Assignment of value for EOC2 in the AFEC_ISR register */
#define AFEC_ISR_EOC3_Pos                     _UINT32_(3)                                          /* (AFEC_ISR) End of Conversion 3 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC3_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC3_Pos)                 /* (AFEC_ISR) End of Conversion 3 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC3(value)                  (AFEC_ISR_EOC3_Msk & (_UINT32_(value) << AFEC_ISR_EOC3_Pos)) /* Assignment of value for EOC3 in the AFEC_ISR register */
#define AFEC_ISR_EOC4_Pos                     _UINT32_(4)                                          /* (AFEC_ISR) End of Conversion 4 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC4_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC4_Pos)                 /* (AFEC_ISR) End of Conversion 4 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC4(value)                  (AFEC_ISR_EOC4_Msk & (_UINT32_(value) << AFEC_ISR_EOC4_Pos)) /* Assignment of value for EOC4 in the AFEC_ISR register */
#define AFEC_ISR_EOC5_Pos                     _UINT32_(5)                                          /* (AFEC_ISR) End of Conversion 5 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC5_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC5_Pos)                 /* (AFEC_ISR) End of Conversion 5 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC5(value)                  (AFEC_ISR_EOC5_Msk & (_UINT32_(value) << AFEC_ISR_EOC5_Pos)) /* Assignment of value for EOC5 in the AFEC_ISR register */
#define AFEC_ISR_EOC6_Pos                     _UINT32_(6)                                          /* (AFEC_ISR) End of Conversion 6 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC6_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC6_Pos)                 /* (AFEC_ISR) End of Conversion 6 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC6(value)                  (AFEC_ISR_EOC6_Msk & (_UINT32_(value) << AFEC_ISR_EOC6_Pos)) /* Assignment of value for EOC6 in the AFEC_ISR register */
#define AFEC_ISR_EOC7_Pos                     _UINT32_(7)                                          /* (AFEC_ISR) End of Conversion 7 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC7_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC7_Pos)                 /* (AFEC_ISR) End of Conversion 7 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC7(value)                  (AFEC_ISR_EOC7_Msk & (_UINT32_(value) << AFEC_ISR_EOC7_Pos)) /* Assignment of value for EOC7 in the AFEC_ISR register */
#define AFEC_ISR_EOC8_Pos                     _UINT32_(8)                                          /* (AFEC_ISR) End of Conversion 8 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC8_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC8_Pos)                 /* (AFEC_ISR) End of Conversion 8 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC8(value)                  (AFEC_ISR_EOC8_Msk & (_UINT32_(value) << AFEC_ISR_EOC8_Pos)) /* Assignment of value for EOC8 in the AFEC_ISR register */
#define AFEC_ISR_EOC9_Pos                     _UINT32_(9)                                          /* (AFEC_ISR) End of Conversion 9 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC9_Msk                     (_UINT32_(0x1) << AFEC_ISR_EOC9_Pos)                 /* (AFEC_ISR) End of Conversion 9 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC9(value)                  (AFEC_ISR_EOC9_Msk & (_UINT32_(value) << AFEC_ISR_EOC9_Pos)) /* Assignment of value for EOC9 in the AFEC_ISR register */
#define AFEC_ISR_EOC10_Pos                    _UINT32_(10)                                         /* (AFEC_ISR) End of Conversion 10 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC10_Msk                    (_UINT32_(0x1) << AFEC_ISR_EOC10_Pos)                /* (AFEC_ISR) End of Conversion 10 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC10(value)                 (AFEC_ISR_EOC10_Msk & (_UINT32_(value) << AFEC_ISR_EOC10_Pos)) /* Assignment of value for EOC10 in the AFEC_ISR register */
#define AFEC_ISR_EOC11_Pos                    _UINT32_(11)                                         /* (AFEC_ISR) End of Conversion 11 (cleared by reading AFEC_CDRx) Position */
#define AFEC_ISR_EOC11_Msk                    (_UINT32_(0x1) << AFEC_ISR_EOC11_Pos)                /* (AFEC_ISR) End of Conversion 11 (cleared by reading AFEC_CDRx) Mask */
#define AFEC_ISR_EOC11(value)                 (AFEC_ISR_EOC11_Msk & (_UINT32_(value) << AFEC_ISR_EOC11_Pos)) /* Assignment of value for EOC11 in the AFEC_ISR register */
#define AFEC_ISR_DRDY_Pos                     _UINT32_(24)                                         /* (AFEC_ISR) Data Ready (cleared by reading AFEC_LCDR) Position */
#define AFEC_ISR_DRDY_Msk                     (_UINT32_(0x1) << AFEC_ISR_DRDY_Pos)                 /* (AFEC_ISR) Data Ready (cleared by reading AFEC_LCDR) Mask */
#define AFEC_ISR_DRDY(value)                  (AFEC_ISR_DRDY_Msk & (_UINT32_(value) << AFEC_ISR_DRDY_Pos)) /* Assignment of value for DRDY in the AFEC_ISR register */
#define AFEC_ISR_GOVRE_Pos                    _UINT32_(25)                                         /* (AFEC_ISR) General Overrun Error (cleared by reading AFEC_ISR) Position */
#define AFEC_ISR_GOVRE_Msk                    (_UINT32_(0x1) << AFEC_ISR_GOVRE_Pos)                /* (AFEC_ISR) General Overrun Error (cleared by reading AFEC_ISR) Mask */
#define AFEC_ISR_GOVRE(value)                 (AFEC_ISR_GOVRE_Msk & (_UINT32_(value) << AFEC_ISR_GOVRE_Pos)) /* Assignment of value for GOVRE in the AFEC_ISR register */
#define AFEC_ISR_COMPE_Pos                    _UINT32_(26)                                         /* (AFEC_ISR) Comparison Error (cleared by reading AFEC_ISR) Position */
#define AFEC_ISR_COMPE_Msk                    (_UINT32_(0x1) << AFEC_ISR_COMPE_Pos)                /* (AFEC_ISR) Comparison Error (cleared by reading AFEC_ISR) Mask */
#define AFEC_ISR_COMPE(value)                 (AFEC_ISR_COMPE_Msk & (_UINT32_(value) << AFEC_ISR_COMPE_Pos)) /* Assignment of value for COMPE in the AFEC_ISR register */
#define AFEC_ISR_TEMPCHG_Pos                  _UINT32_(30)                                         /* (AFEC_ISR) Temperature Change (cleared on read) Position */
#define AFEC_ISR_TEMPCHG_Msk                  (_UINT32_(0x1) << AFEC_ISR_TEMPCHG_Pos)              /* (AFEC_ISR) Temperature Change (cleared on read) Mask */
#define AFEC_ISR_TEMPCHG(value)               (AFEC_ISR_TEMPCHG_Msk & (_UINT32_(value) << AFEC_ISR_TEMPCHG_Pos)) /* Assignment of value for TEMPCHG in the AFEC_ISR register */
#define AFEC_ISR_Msk                          _UINT32_(0x47000FFF)                                 /* (AFEC_ISR) Register Mask  */

#define AFEC_ISR_EOC_Pos                      _UINT32_(0)                                          /* (AFEC_ISR Position) End of Conversion x (cleared by reading AFEC_CDRx) */
#define AFEC_ISR_EOC_Msk                      (_UINT32_(0xFFF) << AFEC_ISR_EOC_Pos)                /* (AFEC_ISR Mask) EOC */
#define AFEC_ISR_EOC(value)                   (AFEC_ISR_EOC_Msk & (_UINT32_(value) << AFEC_ISR_EOC_Pos)) 

/* -------- AFEC_OVER : (AFEC Offset: 0x4C) ( R/ 32) AFEC Overrun Status Register -------- */
#define AFEC_OVER_OVRE0_Pos                   _UINT32_(0)                                          /* (AFEC_OVER) Overrun Error 0 Position */
#define AFEC_OVER_OVRE0_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE0_Pos)               /* (AFEC_OVER) Overrun Error 0 Mask */
#define AFEC_OVER_OVRE0(value)                (AFEC_OVER_OVRE0_Msk & (_UINT32_(value) << AFEC_OVER_OVRE0_Pos)) /* Assignment of value for OVRE0 in the AFEC_OVER register */
#define AFEC_OVER_OVRE1_Pos                   _UINT32_(1)                                          /* (AFEC_OVER) Overrun Error 1 Position */
#define AFEC_OVER_OVRE1_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE1_Pos)               /* (AFEC_OVER) Overrun Error 1 Mask */
#define AFEC_OVER_OVRE1(value)                (AFEC_OVER_OVRE1_Msk & (_UINT32_(value) << AFEC_OVER_OVRE1_Pos)) /* Assignment of value for OVRE1 in the AFEC_OVER register */
#define AFEC_OVER_OVRE2_Pos                   _UINT32_(2)                                          /* (AFEC_OVER) Overrun Error 2 Position */
#define AFEC_OVER_OVRE2_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE2_Pos)               /* (AFEC_OVER) Overrun Error 2 Mask */
#define AFEC_OVER_OVRE2(value)                (AFEC_OVER_OVRE2_Msk & (_UINT32_(value) << AFEC_OVER_OVRE2_Pos)) /* Assignment of value for OVRE2 in the AFEC_OVER register */
#define AFEC_OVER_OVRE3_Pos                   _UINT32_(3)                                          /* (AFEC_OVER) Overrun Error 3 Position */
#define AFEC_OVER_OVRE3_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE3_Pos)               /* (AFEC_OVER) Overrun Error 3 Mask */
#define AFEC_OVER_OVRE3(value)                (AFEC_OVER_OVRE3_Msk & (_UINT32_(value) << AFEC_OVER_OVRE3_Pos)) /* Assignment of value for OVRE3 in the AFEC_OVER register */
#define AFEC_OVER_OVRE4_Pos                   _UINT32_(4)                                          /* (AFEC_OVER) Overrun Error 4 Position */
#define AFEC_OVER_OVRE4_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE4_Pos)               /* (AFEC_OVER) Overrun Error 4 Mask */
#define AFEC_OVER_OVRE4(value)                (AFEC_OVER_OVRE4_Msk & (_UINT32_(value) << AFEC_OVER_OVRE4_Pos)) /* Assignment of value for OVRE4 in the AFEC_OVER register */
#define AFEC_OVER_OVRE5_Pos                   _UINT32_(5)                                          /* (AFEC_OVER) Overrun Error 5 Position */
#define AFEC_OVER_OVRE5_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE5_Pos)               /* (AFEC_OVER) Overrun Error 5 Mask */
#define AFEC_OVER_OVRE5(value)                (AFEC_OVER_OVRE5_Msk & (_UINT32_(value) << AFEC_OVER_OVRE5_Pos)) /* Assignment of value for OVRE5 in the AFEC_OVER register */
#define AFEC_OVER_OVRE6_Pos                   _UINT32_(6)                                          /* (AFEC_OVER) Overrun Error 6 Position */
#define AFEC_OVER_OVRE6_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE6_Pos)               /* (AFEC_OVER) Overrun Error 6 Mask */
#define AFEC_OVER_OVRE6(value)                (AFEC_OVER_OVRE6_Msk & (_UINT32_(value) << AFEC_OVER_OVRE6_Pos)) /* Assignment of value for OVRE6 in the AFEC_OVER register */
#define AFEC_OVER_OVRE7_Pos                   _UINT32_(7)                                          /* (AFEC_OVER) Overrun Error 7 Position */
#define AFEC_OVER_OVRE7_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE7_Pos)               /* (AFEC_OVER) Overrun Error 7 Mask */
#define AFEC_OVER_OVRE7(value)                (AFEC_OVER_OVRE7_Msk & (_UINT32_(value) << AFEC_OVER_OVRE7_Pos)) /* Assignment of value for OVRE7 in the AFEC_OVER register */
#define AFEC_OVER_OVRE8_Pos                   _UINT32_(8)                                          /* (AFEC_OVER) Overrun Error 8 Position */
#define AFEC_OVER_OVRE8_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE8_Pos)               /* (AFEC_OVER) Overrun Error 8 Mask */
#define AFEC_OVER_OVRE8(value)                (AFEC_OVER_OVRE8_Msk & (_UINT32_(value) << AFEC_OVER_OVRE8_Pos)) /* Assignment of value for OVRE8 in the AFEC_OVER register */
#define AFEC_OVER_OVRE9_Pos                   _UINT32_(9)                                          /* (AFEC_OVER) Overrun Error 9 Position */
#define AFEC_OVER_OVRE9_Msk                   (_UINT32_(0x1) << AFEC_OVER_OVRE9_Pos)               /* (AFEC_OVER) Overrun Error 9 Mask */
#define AFEC_OVER_OVRE9(value)                (AFEC_OVER_OVRE9_Msk & (_UINT32_(value) << AFEC_OVER_OVRE9_Pos)) /* Assignment of value for OVRE9 in the AFEC_OVER register */
#define AFEC_OVER_OVRE10_Pos                  _UINT32_(10)                                         /* (AFEC_OVER) Overrun Error 10 Position */
#define AFEC_OVER_OVRE10_Msk                  (_UINT32_(0x1) << AFEC_OVER_OVRE10_Pos)              /* (AFEC_OVER) Overrun Error 10 Mask */
#define AFEC_OVER_OVRE10(value)               (AFEC_OVER_OVRE10_Msk & (_UINT32_(value) << AFEC_OVER_OVRE10_Pos)) /* Assignment of value for OVRE10 in the AFEC_OVER register */
#define AFEC_OVER_OVRE11_Pos                  _UINT32_(11)                                         /* (AFEC_OVER) Overrun Error 11 Position */
#define AFEC_OVER_OVRE11_Msk                  (_UINT32_(0x1) << AFEC_OVER_OVRE11_Pos)              /* (AFEC_OVER) Overrun Error 11 Mask */
#define AFEC_OVER_OVRE11(value)               (AFEC_OVER_OVRE11_Msk & (_UINT32_(value) << AFEC_OVER_OVRE11_Pos)) /* Assignment of value for OVRE11 in the AFEC_OVER register */
#define AFEC_OVER_Msk                         _UINT32_(0x00000FFF)                                 /* (AFEC_OVER) Register Mask  */

#define AFEC_OVER_OVRE_Pos                    _UINT32_(0)                                          /* (AFEC_OVER Position) Overrun Error xx */
#define AFEC_OVER_OVRE_Msk                    (_UINT32_(0xFFF) << AFEC_OVER_OVRE_Pos)              /* (AFEC_OVER Mask) OVRE */
#define AFEC_OVER_OVRE(value)                 (AFEC_OVER_OVRE_Msk & (_UINT32_(value) << AFEC_OVER_OVRE_Pos)) 

