MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
/* -------- AFEC_CWR : (AFEC Offset: 0x50) (R/W 32) AFEC Compare Window Register -------- */
#define AFEC_CWR_LOWTHRES_Pos                 _UINT32_(0)                                          /* (AFEC_CWR) Low Threshold Position */
#define AFEC_CWR_LOWTHRES_Msk                 (_UINT32_(0xFFFF) << AFEC_CWR_LOWTHRES_Pos)          /* (AFEC_CWR) Low Threshold Mask */
#define AFEC_CWR_LOWTHRES(value)              (AFEC_CWR_LOWTHRES_Msk & (_UINT32_(value) << AFEC_CWR_LOWTHRES_Pos)) /* Assignment of value for LOWTHRES in the AFEC_CWR register */
#define AFEC_CWR_HIGHTHRES_Pos                _UINT32_(16)                                         /* (AFEC_CWR) High Threshold Position */
#define AFEC_CWR_HIGHTHRES_Msk                (_UINT32_(0xFFFF) << AFEC_CWR_HIGHTHRES_Pos)         /* (AFEC_CWR) High Threshold Mask */
#define AFEC_CWR_HIGHTHRES(value)             (AFEC_CWR_HIGHTHRES_Msk & (_UINT32_(value) << AFEC_CWR_HIGHTHRES_Pos)) /* Assignment of value for HIGHTHRES in the AFEC_CWR register */
#define AFEC_CWR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (AFEC_CWR) Register Mask  */


/* -------- AFEC_CGR : (AFEC Offset: 0x54) (R/W 32) AFEC Channel Gain Register -------- */
#define AFEC_CGR_GAIN0_Pos                    _UINT32_(0)                                          /* (AFEC_CGR) Gain for Channel 0 Position */
#define AFEC_CGR_GAIN0_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN0_Pos)                /* (AFEC_CGR) Gain for Channel 0 Mask */
#define AFEC_CGR_GAIN0(value)                 (AFEC_CGR_GAIN0_Msk & (_UINT32_(value) << AFEC_CGR_GAIN0_Pos)) /* Assignment of value for GAIN0 in the AFEC_CGR register */
#define AFEC_CGR_GAIN1_Pos                    _UINT32_(2)                                          /* (AFEC_CGR) Gain for Channel 1 Position */
#define AFEC_CGR_GAIN1_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN1_Pos)                /* (AFEC_CGR) Gain for Channel 1 Mask */
#define AFEC_CGR_GAIN1(value)                 (AFEC_CGR_GAIN1_Msk & (_UINT32_(value) << AFEC_CGR_GAIN1_Pos)) /* Assignment of value for GAIN1 in the AFEC_CGR register */
#define AFEC_CGR_GAIN2_Pos                    _UINT32_(4)                                          /* (AFEC_CGR) Gain for Channel 2 Position */
#define AFEC_CGR_GAIN2_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN2_Pos)                /* (AFEC_CGR) Gain for Channel 2 Mask */
#define AFEC_CGR_GAIN2(value)                 (AFEC_CGR_GAIN2_Msk & (_UINT32_(value) << AFEC_CGR_GAIN2_Pos)) /* Assignment of value for GAIN2 in the AFEC_CGR register */
#define AFEC_CGR_GAIN3_Pos                    _UINT32_(6)                                          /* (AFEC_CGR) Gain for Channel 3 Position */
#define AFEC_CGR_GAIN3_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN3_Pos)                /* (AFEC_CGR) Gain for Channel 3 Mask */
#define AFEC_CGR_GAIN3(value)                 (AFEC_CGR_GAIN3_Msk & (_UINT32_(value) << AFEC_CGR_GAIN3_Pos)) /* Assignment of value for GAIN3 in the AFEC_CGR register */
#define AFEC_CGR_GAIN4_Pos                    _UINT32_(8)                                          /* (AFEC_CGR) Gain for Channel 4 Position */
#define AFEC_CGR_GAIN4_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN4_Pos)                /* (AFEC_CGR) Gain for Channel 4 Mask */
#define AFEC_CGR_GAIN4(value)                 (AFEC_CGR_GAIN4_Msk & (_UINT32_(value) << AFEC_CGR_GAIN4_Pos)) /* Assignment of value for GAIN4 in the AFEC_CGR register */
#define AFEC_CGR_GAIN5_Pos                    _UINT32_(10)                                         /* (AFEC_CGR) Gain for Channel 5 Position */
#define AFEC_CGR_GAIN5_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN5_Pos)                /* (AFEC_CGR) Gain for Channel 5 Mask */
#define AFEC_CGR_GAIN5(value)                 (AFEC_CGR_GAIN5_Msk & (_UINT32_(value) << AFEC_CGR_GAIN5_Pos)) /* Assignment of value for GAIN5 in the AFEC_CGR register */
#define AFEC_CGR_GAIN6_Pos                    _UINT32_(12)                                         /* (AFEC_CGR) Gain for Channel 6 Position */
#define AFEC_CGR_GAIN6_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN6_Pos)                /* (AFEC_CGR) Gain for Channel 6 Mask */
#define AFEC_CGR_GAIN6(value)                 (AFEC_CGR_GAIN6_Msk & (_UINT32_(value) << AFEC_CGR_GAIN6_Pos)) /* Assignment of value for GAIN6 in the AFEC_CGR register */
#define AFEC_CGR_GAIN7_Pos                    _UINT32_(14)                                         /* (AFEC_CGR) Gain for Channel 7 Position */
#define AFEC_CGR_GAIN7_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN7_Pos)                /* (AFEC_CGR) Gain for Channel 7 Mask */
#define AFEC_CGR_GAIN7(value)                 (AFEC_CGR_GAIN7_Msk & (_UINT32_(value) << AFEC_CGR_GAIN7_Pos)) /* Assignment of value for GAIN7 in the AFEC_CGR register */
#define AFEC_CGR_GAIN8_Pos                    _UINT32_(16)                                         /* (AFEC_CGR) Gain for Channel 8 Position */
#define AFEC_CGR_GAIN8_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN8_Pos)                /* (AFEC_CGR) Gain for Channel 8 Mask */
#define AFEC_CGR_GAIN8(value)                 (AFEC_CGR_GAIN8_Msk & (_UINT32_(value) << AFEC_CGR_GAIN8_Pos)) /* Assignment of value for GAIN8 in the AFEC_CGR register */
#define AFEC_CGR_GAIN9_Pos                    _UINT32_(18)                                         /* (AFEC_CGR) Gain for Channel 9 Position */
#define AFEC_CGR_GAIN9_Msk                    (_UINT32_(0x3) << AFEC_CGR_GAIN9_Pos)                /* (AFEC_CGR) Gain for Channel 9 Mask */
#define AFEC_CGR_GAIN9(value)                 (AFEC_CGR_GAIN9_Msk & (_UINT32_(value) << AFEC_CGR_GAIN9_Pos)) /* Assignment of value for GAIN9 in the AFEC_CGR register */
#define AFEC_CGR_GAIN10_Pos                   _UINT32_(20)                                         /* (AFEC_CGR) Gain for Channel 10 Position */
#define AFEC_CGR_GAIN10_Msk                   (_UINT32_(0x3) << AFEC_CGR_GAIN10_Pos)               /* (AFEC_CGR) Gain for Channel 10 Mask */
#define AFEC_CGR_GAIN10(value)                (AFEC_CGR_GAIN10_Msk & (_UINT32_(value) << AFEC_CGR_GAIN10_Pos)) /* Assignment of value for GAIN10 in the AFEC_CGR register */
#define AFEC_CGR_GAIN11_Pos                   _UINT32_(22)                                         /* (AFEC_CGR) Gain for Channel 11 Position */
#define AFEC_CGR_GAIN11_Msk                   (_UINT32_(0x3) << AFEC_CGR_GAIN11_Pos)               /* (AFEC_CGR) Gain for Channel 11 Mask */
#define AFEC_CGR_GAIN11(value)                (AFEC_CGR_GAIN11_Msk & (_UINT32_(value) << AFEC_CGR_GAIN11_Pos)) /* Assignment of value for GAIN11 in the AFEC_CGR register */
#define AFEC_CGR_Msk                          _UINT32_(0x00FFFFFF)                                 /* (AFEC_CGR) Register Mask  */


/* -------- AFEC_DIFFR : (AFEC Offset: 0x60) (R/W 32) AFEC Channel Differential Register -------- */
#define AFEC_DIFFR_DIFF0_Pos                  _UINT32_(0)                                          /* (AFEC_DIFFR) Differential inputs for channel 0 Position */
#define AFEC_DIFFR_DIFF0_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF0_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 0 Mask */
#define AFEC_DIFFR_DIFF0(value)               (AFEC_DIFFR_DIFF0_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF0_Pos)) /* Assignment of value for DIFF0 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF1_Pos                  _UINT32_(1)                                          /* (AFEC_DIFFR) Differential inputs for channel 1 Position */
#define AFEC_DIFFR_DIFF1_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF1_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 1 Mask */
#define AFEC_DIFFR_DIFF1(value)               (AFEC_DIFFR_DIFF1_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF1_Pos)) /* Assignment of value for DIFF1 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF2_Pos                  _UINT32_(2)                                          /* (AFEC_DIFFR) Differential inputs for channel 2 Position */
#define AFEC_DIFFR_DIFF2_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF2_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 2 Mask */
#define AFEC_DIFFR_DIFF2(value)               (AFEC_DIFFR_DIFF2_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF2_Pos)) /* Assignment of value for DIFF2 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF3_Pos                  _UINT32_(3)                                          /* (AFEC_DIFFR) Differential inputs for channel 3 Position */
#define AFEC_DIFFR_DIFF3_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF3_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 3 Mask */
#define AFEC_DIFFR_DIFF3(value)               (AFEC_DIFFR_DIFF3_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF3_Pos)) /* Assignment of value for DIFF3 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF4_Pos                  _UINT32_(4)                                          /* (AFEC_DIFFR) Differential inputs for channel 4 Position */
#define AFEC_DIFFR_DIFF4_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF4_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 4 Mask */
#define AFEC_DIFFR_DIFF4(value)               (AFEC_DIFFR_DIFF4_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF4_Pos)) /* Assignment of value for DIFF4 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF5_Pos                  _UINT32_(5)                                          /* (AFEC_DIFFR) Differential inputs for channel 5 Position */
#define AFEC_DIFFR_DIFF5_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF5_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 5 Mask */
#define AFEC_DIFFR_DIFF5(value)               (AFEC_DIFFR_DIFF5_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF5_Pos)) /* Assignment of value for DIFF5 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF6_Pos                  _UINT32_(6)                                          /* (AFEC_DIFFR) Differential inputs for channel 6 Position */
#define AFEC_DIFFR_DIFF6_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF6_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 6 Mask */
#define AFEC_DIFFR_DIFF6(value)               (AFEC_DIFFR_DIFF6_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF6_Pos)) /* Assignment of value for DIFF6 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF7_Pos                  _UINT32_(7)                                          /* (AFEC_DIFFR) Differential inputs for channel 7 Position */
#define AFEC_DIFFR_DIFF7_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF7_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 7 Mask */
#define AFEC_DIFFR_DIFF7(value)               (AFEC_DIFFR_DIFF7_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF7_Pos)) /* Assignment of value for DIFF7 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF8_Pos                  _UINT32_(8)                                          /* (AFEC_DIFFR) Differential inputs for channel 8 Position */
#define AFEC_DIFFR_DIFF8_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF8_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 8 Mask */
#define AFEC_DIFFR_DIFF8(value)               (AFEC_DIFFR_DIFF8_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF8_Pos)) /* Assignment of value for DIFF8 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF9_Pos                  _UINT32_(9)                                          /* (AFEC_DIFFR) Differential inputs for channel 9 Position */
#define AFEC_DIFFR_DIFF9_Msk                  (_UINT32_(0x1) << AFEC_DIFFR_DIFF9_Pos)              /* (AFEC_DIFFR) Differential inputs for channel 9 Mask */
#define AFEC_DIFFR_DIFF9(value)               (AFEC_DIFFR_DIFF9_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF9_Pos)) /* Assignment of value for DIFF9 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF10_Pos                 _UINT32_(10)                                         /* (AFEC_DIFFR) Differential inputs for channel 10 Position */
#define AFEC_DIFFR_DIFF10_Msk                 (_UINT32_(0x1) << AFEC_DIFFR_DIFF10_Pos)             /* (AFEC_DIFFR) Differential inputs for channel 10 Mask */
#define AFEC_DIFFR_DIFF10(value)              (AFEC_DIFFR_DIFF10_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF10_Pos)) /* Assignment of value for DIFF10 in the AFEC_DIFFR register */
#define AFEC_DIFFR_DIFF11_Pos                 _UINT32_(11)                                         /* (AFEC_DIFFR) Differential inputs for channel 11 Position */
#define AFEC_DIFFR_DIFF11_Msk                 (_UINT32_(0x1) << AFEC_DIFFR_DIFF11_Pos)             /* (AFEC_DIFFR) Differential inputs for channel 11 Mask */
#define AFEC_DIFFR_DIFF11(value)              (AFEC_DIFFR_DIFF11_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF11_Pos)) /* Assignment of value for DIFF11 in the AFEC_DIFFR register */
#define AFEC_DIFFR_Msk                        _UINT32_(0x00000FFF)                                 /* (AFEC_DIFFR) Register Mask  */

