MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
#define AFEC_DIFFR_DIFF_Pos                   _UINT32_(0)                                          /* (AFEC_DIFFR Position) Differential inputs for channel xx */
#define AFEC_DIFFR_DIFF_Msk                   (_UINT32_(0xFFF) << AFEC_DIFFR_DIFF_Pos)             /* (AFEC_DIFFR Mask) DIFF */
#define AFEC_DIFFR_DIFF(value)                (AFEC_DIFFR_DIFF_Msk & (_UINT32_(value) << AFEC_DIFFR_DIFF_Pos)) 

/* -------- AFEC_CSELR : (AFEC Offset: 0x64) (R/W 32) AFEC Channel Selection Register -------- */
#define AFEC_CSELR_CSEL_Pos                   _UINT32_(0)                                          /* (AFEC_CSELR) Channel Selection Position */
#define AFEC_CSELR_CSEL_Msk                   (_UINT32_(0xF) << AFEC_CSELR_CSEL_Pos)               /* (AFEC_CSELR) Channel Selection Mask */
#define AFEC_CSELR_CSEL(value)                (AFEC_CSELR_CSEL_Msk & (_UINT32_(value) << AFEC_CSELR_CSEL_Pos)) /* Assignment of value for CSEL in the AFEC_CSELR register */
#define AFEC_CSELR_Msk                        _UINT32_(0x0000000F)                                 /* (AFEC_CSELR) Register Mask  */


/* -------- AFEC_CDR : (AFEC Offset: 0x68) ( R/ 32) AFEC Channel Data Register -------- */
#define AFEC_CDR_DATA_Pos                     _UINT32_(0)                                          /* (AFEC_CDR) Converted Data Position */
#define AFEC_CDR_DATA_Msk                     (_UINT32_(0xFFFF) << AFEC_CDR_DATA_Pos)              /* (AFEC_CDR) Converted Data Mask */
#define AFEC_CDR_DATA(value)                  (AFEC_CDR_DATA_Msk & (_UINT32_(value) << AFEC_CDR_DATA_Pos)) /* Assignment of value for DATA in the AFEC_CDR register */
#define AFEC_CDR_Msk                          _UINT32_(0x0000FFFF)                                 /* (AFEC_CDR) Register Mask  */


/* -------- AFEC_COCR : (AFEC Offset: 0x6C) (R/W 32) AFEC Channel Offset Compensation Register -------- */
#define AFEC_COCR_AOFF_Pos                    _UINT32_(0)                                          /* (AFEC_COCR) Analog Offset Position */
#define AFEC_COCR_AOFF_Msk                    (_UINT32_(0x3FF) << AFEC_COCR_AOFF_Pos)              /* (AFEC_COCR) Analog Offset Mask */
#define AFEC_COCR_AOFF(value)                 (AFEC_COCR_AOFF_Msk & (_UINT32_(value) << AFEC_COCR_AOFF_Pos)) /* Assignment of value for AOFF in the AFEC_COCR register */
#define AFEC_COCR_Msk                         _UINT32_(0x000003FF)                                 /* (AFEC_COCR) Register Mask  */


/* -------- AFEC_TEMPMR : (AFEC Offset: 0x70) (R/W 32) AFEC Temperature Sensor Mode Register -------- */
#define AFEC_TEMPMR_RTCT_Pos                  _UINT32_(0)                                          /* (AFEC_TEMPMR) Temperature Sensor RTC Trigger Mode Position */
#define AFEC_TEMPMR_RTCT_Msk                  (_UINT32_(0x1) << AFEC_TEMPMR_RTCT_Pos)              /* (AFEC_TEMPMR) Temperature Sensor RTC Trigger Mode Mask */
#define AFEC_TEMPMR_RTCT(value)               (AFEC_TEMPMR_RTCT_Msk & (_UINT32_(value) << AFEC_TEMPMR_RTCT_Pos)) /* Assignment of value for RTCT in the AFEC_TEMPMR register */
#define AFEC_TEMPMR_TEMPCMPMOD_Pos            _UINT32_(4)                                          /* (AFEC_TEMPMR) Temperature Comparison Mode Position */
#define AFEC_TEMPMR_TEMPCMPMOD_Msk            (_UINT32_(0x3) << AFEC_TEMPMR_TEMPCMPMOD_Pos)        /* (AFEC_TEMPMR) Temperature Comparison Mode Mask */
#define AFEC_TEMPMR_TEMPCMPMOD(value)         (AFEC_TEMPMR_TEMPCMPMOD_Msk & (_UINT32_(value) << AFEC_TEMPMR_TEMPCMPMOD_Pos)) /* Assignment of value for TEMPCMPMOD in the AFEC_TEMPMR register */
#define   AFEC_TEMPMR_TEMPCMPMOD_LOW_Val      _UINT32_(0x0)                                        /* (AFEC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_HIGH_Val     _UINT32_(0x1)                                        /* (AFEC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_IN_Val       _UINT32_(0x2)                                        /* (AFEC_TEMPMR) Generates an event when the converted data is in the comparison window.  */
#define   AFEC_TEMPMR_TEMPCMPMOD_OUT_Val      _UINT32_(0x3)                                        /* (AFEC_TEMPMR) Generates an event when the converted data is out of the comparison window.  */
#define AFEC_TEMPMR_TEMPCMPMOD_LOW            (AFEC_TEMPMR_TEMPCMPMOD_LOW_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos) /* (AFEC_TEMPMR) Generates an event when the converted data is lower than the low threshold of the window. Position */
#define AFEC_TEMPMR_TEMPCMPMOD_HIGH           (AFEC_TEMPMR_TEMPCMPMOD_HIGH_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos) /* (AFEC_TEMPMR) Generates an event when the converted data is higher than the high threshold of the window. Position */
#define AFEC_TEMPMR_TEMPCMPMOD_IN             (AFEC_TEMPMR_TEMPCMPMOD_IN_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos) /* (AFEC_TEMPMR) Generates an event when the converted data is in the comparison window. Position */
#define AFEC_TEMPMR_TEMPCMPMOD_OUT            (AFEC_TEMPMR_TEMPCMPMOD_OUT_Val << AFEC_TEMPMR_TEMPCMPMOD_Pos) /* (AFEC_TEMPMR) Generates an event when the converted data is out of the comparison window. Position */
#define AFEC_TEMPMR_Msk                       _UINT32_(0x00000031)                                 /* (AFEC_TEMPMR) Register Mask  */


/* -------- AFEC_TEMPCWR : (AFEC Offset: 0x74) (R/W 32) AFEC Temperature Compare Window Register -------- */
#define AFEC_TEMPCWR_TLOWTHRES_Pos            _UINT32_(0)                                          /* (AFEC_TEMPCWR) Temperature Low Threshold Position */
#define AFEC_TEMPCWR_TLOWTHRES_Msk            (_UINT32_(0xFFFF) << AFEC_TEMPCWR_TLOWTHRES_Pos)     /* (AFEC_TEMPCWR) Temperature Low Threshold Mask */
#define AFEC_TEMPCWR_TLOWTHRES(value)         (AFEC_TEMPCWR_TLOWTHRES_Msk & (_UINT32_(value) << AFEC_TEMPCWR_TLOWTHRES_Pos)) /* Assignment of value for TLOWTHRES in the AFEC_TEMPCWR register */
#define AFEC_TEMPCWR_THIGHTHRES_Pos           _UINT32_(16)                                         /* (AFEC_TEMPCWR) Temperature High Threshold Position */
#define AFEC_TEMPCWR_THIGHTHRES_Msk           (_UINT32_(0xFFFF) << AFEC_TEMPCWR_THIGHTHRES_Pos)    /* (AFEC_TEMPCWR) Temperature High Threshold Mask */
#define AFEC_TEMPCWR_THIGHTHRES(value)        (AFEC_TEMPCWR_THIGHTHRES_Msk & (_UINT32_(value) << AFEC_TEMPCWR_THIGHTHRES_Pos)) /* Assignment of value for THIGHTHRES in the AFEC_TEMPCWR register */
#define AFEC_TEMPCWR_Msk                      _UINT32_(0xFFFFFFFF)                                 /* (AFEC_TEMPCWR) Register Mask  */


