MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
/* -------- AFEC_ACR : (AFEC Offset: 0x94) (R/W 32) AFEC Analog Control Register -------- */
#define AFEC_ACR_PGA0EN_Pos                   _UINT32_(2)                                          /* (AFEC_ACR) PGA0 Enable Position */
#define AFEC_ACR_PGA0EN_Msk                   (_UINT32_(0x1) << AFEC_ACR_PGA0EN_Pos)               /* (AFEC_ACR) PGA0 Enable Mask */
#define AFEC_ACR_PGA0EN(value)                (AFEC_ACR_PGA0EN_Msk & (_UINT32_(value) << AFEC_ACR_PGA0EN_Pos)) /* Assignment of value for PGA0EN in the AFEC_ACR register */
#define AFEC_ACR_PGA1EN_Pos                   _UINT32_(3)                                          /* (AFEC_ACR) PGA1 Enable Position */
#define AFEC_ACR_PGA1EN_Msk                   (_UINT32_(0x1) << AFEC_ACR_PGA1EN_Pos)               /* (AFEC_ACR) PGA1 Enable Mask */
#define AFEC_ACR_PGA1EN(value)                (AFEC_ACR_PGA1EN_Msk & (_UINT32_(value) << AFEC_ACR_PGA1EN_Pos)) /* Assignment of value for PGA1EN in the AFEC_ACR register */
#define AFEC_ACR_IBCTL_Pos                    _UINT32_(8)                                          /* (AFEC_ACR) AFE Bias Current Control Position */
#define AFEC_ACR_IBCTL_Msk                    (_UINT32_(0x3) << AFEC_ACR_IBCTL_Pos)                /* (AFEC_ACR) AFE Bias Current Control Mask */
#define AFEC_ACR_IBCTL(value)                 (AFEC_ACR_IBCTL_Msk & (_UINT32_(value) << AFEC_ACR_IBCTL_Pos)) /* Assignment of value for IBCTL in the AFEC_ACR register */
#define AFEC_ACR_Msk                          _UINT32_(0x0000030C)                                 /* (AFEC_ACR) Register Mask  */


/* -------- AFEC_SHMR : (AFEC Offset: 0xA0) (R/W 32) AFEC Sample & Hold Mode Register -------- */
#define AFEC_SHMR_DUAL0_Pos                   _UINT32_(0)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 0 Position */
#define AFEC_SHMR_DUAL0_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL0_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 0 Mask */
#define AFEC_SHMR_DUAL0(value)                (AFEC_SHMR_DUAL0_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL0_Pos)) /* Assignment of value for DUAL0 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL1_Pos                   _UINT32_(1)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 1 Position */
#define AFEC_SHMR_DUAL1_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL1_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 1 Mask */
#define AFEC_SHMR_DUAL1(value)                (AFEC_SHMR_DUAL1_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL1_Pos)) /* Assignment of value for DUAL1 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL2_Pos                   _UINT32_(2)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 2 Position */
#define AFEC_SHMR_DUAL2_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL2_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 2 Mask */
#define AFEC_SHMR_DUAL2(value)                (AFEC_SHMR_DUAL2_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL2_Pos)) /* Assignment of value for DUAL2 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL3_Pos                   _UINT32_(3)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 3 Position */
#define AFEC_SHMR_DUAL3_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL3_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 3 Mask */
#define AFEC_SHMR_DUAL3(value)                (AFEC_SHMR_DUAL3_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL3_Pos)) /* Assignment of value for DUAL3 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL4_Pos                   _UINT32_(4)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 4 Position */
#define AFEC_SHMR_DUAL4_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL4_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 4 Mask */
#define AFEC_SHMR_DUAL4(value)                (AFEC_SHMR_DUAL4_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL4_Pos)) /* Assignment of value for DUAL4 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL5_Pos                   _UINT32_(5)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 5 Position */
#define AFEC_SHMR_DUAL5_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL5_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 5 Mask */
#define AFEC_SHMR_DUAL5(value)                (AFEC_SHMR_DUAL5_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL5_Pos)) /* Assignment of value for DUAL5 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL6_Pos                   _UINT32_(6)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 6 Position */
#define AFEC_SHMR_DUAL6_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL6_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 6 Mask */
#define AFEC_SHMR_DUAL6(value)                (AFEC_SHMR_DUAL6_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL6_Pos)) /* Assignment of value for DUAL6 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL7_Pos                   _UINT32_(7)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 7 Position */
#define AFEC_SHMR_DUAL7_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL7_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 7 Mask */
#define AFEC_SHMR_DUAL7(value)                (AFEC_SHMR_DUAL7_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL7_Pos)) /* Assignment of value for DUAL7 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL8_Pos                   _UINT32_(8)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 8 Position */
#define AFEC_SHMR_DUAL8_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL8_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 8 Mask */
#define AFEC_SHMR_DUAL8(value)                (AFEC_SHMR_DUAL8_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL8_Pos)) /* Assignment of value for DUAL8 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL9_Pos                   _UINT32_(9)                                          /* (AFEC_SHMR) Dual Sample & Hold for channel 9 Position */
#define AFEC_SHMR_DUAL9_Msk                   (_UINT32_(0x1) << AFEC_SHMR_DUAL9_Pos)               /* (AFEC_SHMR) Dual Sample & Hold for channel 9 Mask */
#define AFEC_SHMR_DUAL9(value)                (AFEC_SHMR_DUAL9_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL9_Pos)) /* Assignment of value for DUAL9 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL10_Pos                  _UINT32_(10)                                         /* (AFEC_SHMR) Dual Sample & Hold for channel 10 Position */
#define AFEC_SHMR_DUAL10_Msk                  (_UINT32_(0x1) << AFEC_SHMR_DUAL10_Pos)              /* (AFEC_SHMR) Dual Sample & Hold for channel 10 Mask */
#define AFEC_SHMR_DUAL10(value)               (AFEC_SHMR_DUAL10_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL10_Pos)) /* Assignment of value for DUAL10 in the AFEC_SHMR register */
#define AFEC_SHMR_DUAL11_Pos                  _UINT32_(11)                                         /* (AFEC_SHMR) Dual Sample & Hold for channel 11 Position */
#define AFEC_SHMR_DUAL11_Msk                  (_UINT32_(0x1) << AFEC_SHMR_DUAL11_Pos)              /* (AFEC_SHMR) Dual Sample & Hold for channel 11 Mask */
#define AFEC_SHMR_DUAL11(value)               (AFEC_SHMR_DUAL11_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL11_Pos)) /* Assignment of value for DUAL11 in the AFEC_SHMR register */
#define AFEC_SHMR_Msk                         _UINT32_(0x00000FFF)                                 /* (AFEC_SHMR) Register Mask  */

#define AFEC_SHMR_DUAL_Pos                    _UINT32_(0)                                          /* (AFEC_SHMR Position) Dual Sample & Hold for channel xx */
#define AFEC_SHMR_DUAL_Msk                    (_UINT32_(0xFFF) << AFEC_SHMR_DUAL_Pos)              /* (AFEC_SHMR Mask) DUAL */
#define AFEC_SHMR_DUAL(value)                 (AFEC_SHMR_DUAL_Msk & (_UINT32_(value) << AFEC_SHMR_DUAL_Pos)) 

/* -------- AFEC_COSR : (AFEC Offset: 0xD0) (R/W 32) AFEC Correction Select Register -------- */
#define AFEC_COSR_CSEL_Pos                    _UINT32_(0)                                          /* (AFEC_COSR) Sample & Hold unit Correction Select Position */
#define AFEC_COSR_CSEL_Msk                    (_UINT32_(0x1) << AFEC_COSR_CSEL_Pos)                /* (AFEC_COSR) Sample & Hold unit Correction Select Mask */
#define AFEC_COSR_CSEL(value)                 (AFEC_COSR_CSEL_Msk & (_UINT32_(value) << AFEC_COSR_CSEL_Pos)) /* Assignment of value for CSEL in the AFEC_COSR register */
#define AFEC_COSR_Msk                         _UINT32_(0x00000001)                                 /* (AFEC_COSR) Register Mask  */


