MikroElektronika/core_packages/ARM/gcc_clang/system/src/pic32/pic32cz_mc7/thirdparty/pic32cz_mc7/component/afec.h
/* -------- AFEC_WPMR : (AFEC Offset: 0xE4) (R/W 32) AFEC Write Protection Mode Register -------- */
#define AFEC_WPMR_WPEN_Pos                    _UINT32_(0)                                          /* (AFEC_WPMR) Write Protection Enable Position */
#define AFEC_WPMR_WPEN_Msk                    (_UINT32_(0x1) << AFEC_WPMR_WPEN_Pos)                /* (AFEC_WPMR) Write Protection Enable Mask */
#define AFEC_WPMR_WPEN(value)                 (AFEC_WPMR_WPEN_Msk & (_UINT32_(value) << AFEC_WPMR_WPEN_Pos)) /* Assignment of value for WPEN in the AFEC_WPMR register */
#define AFEC_WPMR_WPKEY_Pos                   _UINT32_(8)                                          /* (AFEC_WPMR) Write Protect KEY Position */
#define AFEC_WPMR_WPKEY_Msk                   (_UINT32_(0xFFFFFF) << AFEC_WPMR_WPKEY_Pos)          /* (AFEC_WPMR) Write Protect KEY Mask */
#define AFEC_WPMR_WPKEY(value)                (AFEC_WPMR_WPKEY_Msk & (_UINT32_(value) << AFEC_WPMR_WPKEY_Pos)) /* Assignment of value for WPKEY in the AFEC_WPMR register */
#define   AFEC_WPMR_WPKEY_PASSWD_Val          _UINT32_(0x414443)                                   /* (AFEC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.  */
#define AFEC_WPMR_WPKEY_PASSWD                (AFEC_WPMR_WPKEY_PASSWD_Val << AFEC_WPMR_WPKEY_Pos)  /* (AFEC_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0. Position */
#define AFEC_WPMR_Msk                         _UINT32_(0xFFFFFF01)                                 /* (AFEC_WPMR) Register Mask  */


/* -------- AFEC_WPSR : (AFEC Offset: 0xE8) ( R/ 32) AFEC Write Protection Status Register -------- */
#define AFEC_WPSR_WPVS_Pos                    _UINT32_(0)                                          /* (AFEC_WPSR) Write Protect Violation Status Position */
#define AFEC_WPSR_WPVS_Msk                    (_UINT32_(0x1) << AFEC_WPSR_WPVS_Pos)                /* (AFEC_WPSR) Write Protect Violation Status Mask */
#define AFEC_WPSR_WPVS(value)                 (AFEC_WPSR_WPVS_Msk & (_UINT32_(value) << AFEC_WPSR_WPVS_Pos)) /* Assignment of value for WPVS in the AFEC_WPSR register */
#define AFEC_WPSR_WPVSRC_Pos                  _UINT32_(8)                                          /* (AFEC_WPSR) Write Protect Violation Source Position */
#define AFEC_WPSR_WPVSRC_Msk                  (_UINT32_(0xFFFF) << AFEC_WPSR_WPVSRC_Pos)           /* (AFEC_WPSR) Write Protect Violation Source Mask */
#define AFEC_WPSR_WPVSRC(value)               (AFEC_WPSR_WPVSRC_Msk & (_UINT32_(value) << AFEC_WPSR_WPVSRC_Pos)) /* Assignment of value for WPVSRC in the AFEC_WPSR register */
#define AFEC_WPSR_Msk                         _UINT32_(0x00FFFF01)                                 /* (AFEC_WPSR) Register Mask  */


/* AFEC register offsets definitions */
#define AFEC_CR_REG_OFST               _UINT32_(0x00)      /* (AFEC_CR) AFEC Control Register Offset */
#define AFEC_MR_REG_OFST               _UINT32_(0x04)      /* (AFEC_MR) AFEC Mode Register Offset */
#define AFEC_EMR_REG_OFST              _UINT32_(0x08)      /* (AFEC_EMR) AFEC Extended Mode Register Offset */
#define AFEC_SEQ1R_REG_OFST            _UINT32_(0x0C)      /* (AFEC_SEQ1R) AFEC Channel Sequence 1 Register Offset */
#define AFEC_SEQ2R_REG_OFST            _UINT32_(0x10)      /* (AFEC_SEQ2R) AFEC Channel Sequence 2 Register Offset */
#define AFEC_CHER_REG_OFST             _UINT32_(0x14)      /* (AFEC_CHER) AFEC Channel Enable Register Offset */
#define AFEC_CHDR_REG_OFST             _UINT32_(0x18)      /* (AFEC_CHDR) AFEC Channel Disable Register Offset */
#define AFEC_CHSR_REG_OFST             _UINT32_(0x1C)      /* (AFEC_CHSR) AFEC Channel Status Register Offset */
#define AFEC_LCDR_REG_OFST             _UINT32_(0x20)      /* (AFEC_LCDR) AFEC Last Converted Data Register Offset */
#define AFEC_IER_REG_OFST              _UINT32_(0x24)      /* (AFEC_IER) AFEC Interrupt Enable Register Offset */
#define AFEC_IDR_REG_OFST              _UINT32_(0x28)      /* (AFEC_IDR) AFEC Interrupt Disable Register Offset */
#define AFEC_IMR_REG_OFST              _UINT32_(0x2C)      /* (AFEC_IMR) AFEC Interrupt Mask Register Offset */
#define AFEC_ISR_REG_OFST              _UINT32_(0x30)      /* (AFEC_ISR) AFEC Interrupt Status Register Offset */
#define AFEC_OVER_REG_OFST             _UINT32_(0x4C)      /* (AFEC_OVER) AFEC Overrun Status Register Offset */
#define AFEC_CWR_REG_OFST              _UINT32_(0x50)      /* (AFEC_CWR) AFEC Compare Window Register Offset */
#define AFEC_CGR_REG_OFST              _UINT32_(0x54)      /* (AFEC_CGR) AFEC Channel Gain Register Offset */
#define AFEC_DIFFR_REG_OFST            _UINT32_(0x60)      /* (AFEC_DIFFR) AFEC Channel Differential Register Offset */
#define AFEC_CSELR_REG_OFST            _UINT32_(0x64)      /* (AFEC_CSELR) AFEC Channel Selection Register Offset */
#define AFEC_CDR_REG_OFST              _UINT32_(0x68)      /* (AFEC_CDR) AFEC Channel Data Register Offset */
#define AFEC_COCR_REG_OFST             _UINT32_(0x6C)      /* (AFEC_COCR) AFEC Channel Offset Compensation Register Offset */
#define AFEC_TEMPMR_REG_OFST           _UINT32_(0x70)      /* (AFEC_TEMPMR) AFEC Temperature Sensor Mode Register Offset */
#define AFEC_TEMPCWR_REG_OFST          _UINT32_(0x74)      /* (AFEC_TEMPCWR) AFEC Temperature Compare Window Register Offset */
#define AFEC_ACR_REG_OFST              _UINT32_(0x94)      /* (AFEC_ACR) AFEC Analog Control Register Offset */
#define AFEC_SHMR_REG_OFST             _UINT32_(0xA0)      /* (AFEC_SHMR) AFEC Sample & Hold Mode Register Offset */
#define AFEC_COSR_REG_OFST             _UINT32_(0xD0)      /* (AFEC_COSR) AFEC Correction Select Register Offset */
#define AFEC_CVR_REG_OFST              _UINT32_(0xD4)      /* (AFEC_CVR) AFEC Correction Values Register Offset */
#define AFEC_CECR_REG_OFST             _UINT32_(0xD8)      /* (AFEC_CECR) AFEC Channel Error Correction Register Offset */
#define AFEC_WPMR_REG_OFST             _UINT32_(0xE4)      /* (AFEC_WPMR) AFEC Write Protection Mode Register Offset */
#define AFEC_WPSR_REG_OFST             _UINT32_(0xE8)      /* (AFEC_WPSR) AFEC Write Protection Status Register Offset */

